apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_fcfg1.h
/********************************************************************************************************************
 * arch/arm/src/tiva/hardware/cc13x0/cc13x0_fcfg1.h
 *
 *   Copyright (C) 2018 Gregory Nutt. All rights reserved.
 *   Authors: Gregory Nutt <gnutt@nuttx.org>
 *
 * Technical content derives from a TI header file that has a compatible BSD license:
 *
 *   Copyright (c) 2015-2017, Texas Instruments Incorporated
 *   All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ********************************************************************************************************************/

#ifndef __ARCH_ARM_SRC_TIVA_HARDWARE_CC13X0_CC13X0_FCFG1_H
#define __ARCH_ARM_SRC_TIVA_HARDWARE_CC13X0_CC13X0_FCFG1_H

/********************************************************************************************************************
 * Included Files
 ********************************************************************************************************************/

#include <nuttx/config.h>
#include "hardware/tiva_memorymap.h"

/********************************************************************************************************************
 * Pre-processor Definitions
 ********************************************************************************************************************/

/* FCFG1 Register Offsets *******************************************************************************************/

#define TIVA_FCFG1_MISC_CONF_1_OFFSET                      0x00a0  /* Misc configurations */
#define TIVA_FCFG1_MISC_CONF_2_OFFSET                      0x00a4
#define TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV5_OFFSET          0x00c4
#define TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV6_OFFSET          0x00c8
#define TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV10_OFFSET         0x00cc
#define TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV12_OFFSET         0x00d0
#define TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV15_OFFSET         0x00d4
#define TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV30_OFFSET         0x00d8
#define TIVA_FCFG1_CONFIG_SYNTH_DIV5_OFFSET                0x00dc
#define TIVA_FCFG1_CONFIG_SYNTH_DIV6_OFFSET                0x00e0
#define TIVA_FCFG1_CONFIG_SYNTH_DIV10_OFFSET               0x00e4
#define TIVA_FCFG1_CONFIG_SYNTH_DIV12_OFFSET               0x00e8
#define TIVA_FCFG1_CONFIG_SYNTH_DIV15_OFFSET               0x00ec
#define TIVA_FCFG1_CONFIG_SYNTH_DIV30_OFFSET               0x00f0
#define TIVA_FCFG1_CONFIG_MISC_ADC_DIV5_OFFSET             0x00f4
#define TIVA_FCFG1_CONFIG_MISC_ADC_DIV6_OFFSET             0x00f8
#define TIVA_FCFG1_CONFIG_MISC_ADC_DIV10_OFFSET            0x00fc
#define TIVA_FCFG1_CONFIG_MISC_ADC_DIV12_OFFSET            0x0100
#define TIVA_FCFG1_CONFIG_MISC_ADC_DIV15_OFFSET            0x0104
#define TIVA_FCFG1_CONFIG_MISC_ADC_DIV30_OFFSET            0x0108
#define TIVA_FCFG1_SHDW_DIE_ID_0_OFFSET                    0x0118  /* Shadow of EFUSE:DIE_ID_0 */
#define TIVA_FCFG1_SHDW_DIE_ID_1_OFFSET                    0x011c  /* Shadow of EFUSE:DIE_ID_1 */
#define TIVA_FCFG1_SHDW_DIE_ID_2_OFFSET                    0x0120  /* Shadow of EFUSE:DIE_ID_2 */
#define TIVA_FCFG1_SHDW_DIE_ID_3_OFFSET                    0x0124  /* Shadow of EFUSE:DIE_ID_3 */
#define TIVA_FCFG1_SHDW_OSC_BIAS_LDO_TRIM_OFFSET           0x0138
#define TIVA_FCFG1_SHDW_ANA_TRIM_OFFSET                    0x013c
#define TIVA_FCFG1_FLASH_NUMBER_OFFSET                     0x0164  /* Flash information */
#define TIVA_FCFG1_FLASH_COORDINATE_OFFSET                 0x016c  /* Flash information */
#define TIVA_FCFG1_FLASH_E_P_OFFSET                        0x0170
#define TIVA_FCFG1_FLASH_C_E_P_R_OFFSET                    0x0174
#define TIVA_FCFG1_FLASH_P_R_PV_OFFSET                     0x0178
#define TIVA_FCFG1_FLASH_EH_SEQ_OFFSET                     0x017c
#define TIVA_FCFG1_FLASH_VHV_E_OFFSET                      0x0180
#define TIVA_FCFG1_FLASH_PP_OFFSET                         0x0184
#define TIVA_FCFG1_FLASH_PROG_EP_OFFSET                    0x0188
#define TIVA_FCFG1_FLASH_ERA_PW_OFFSET                     0x018c
#define TIVA_FCFG1_FLASH_VHV_OFFSET                        0x0190
#define TIVA_FCFG1_FLASH_VHV_PV_OFFSET                     0x0194
#define TIVA_FCFG1_FLASH_V_OFFSET                          0x0198
#define TIVA_FCFG1_USER_ID_OFFSET                          0x0294  /* User Identification. */
#define TIVA_FCFG1_FLASH_OTP_DATA3_OFFSET                  0x02b0
#define TIVA_FCFG1_ANA2_TRIM_OFFSET                        0x02b4
#define TIVA_FCFG1_LDO_TRIM_OFFSET                         0x02b8
#define TIVA_FCFG1_BAT_RC_LDO_TRIM_OFFSET                  0x02bc
#define TIVA_FCFG1_MAC_BLE_0_OFFSET                        0x02e8  /* MAC BLE Address 0 */
#define TIVA_FCFG1_MAC_BLE_1_OFFSET                        0x02ec  /* MAC BLE Address 1 */
#define TIVA_FCFG1_MAC_15_4_0_OFFSET                       0x02f0  /* MAC IEEE 802.15.4 Address 0 */
#define TIVA_FCFG1_MAC_15_4_1_OFFSET                       0x02f4  /* MAC IEEE 802.15.4 Address 1 */
#define TIVA_FCFG1_FLASH_OTP_DATA4_OFFSET                  0x0308
#define TIVA_FCFG1_MISC_TRIM_OFFSET                        0x030c  /* Miscellaneous Trim  Parameters */
#define TIVA_FCFG1_RCOSC_HF_TEMPCOMP_OFFSET                0x0310
#define TIVA_FCFG1_TRIM_CAL_REVISION_OFFSET                0x0314
#define TIVA_FCFG1_ICEPICK_DEVICE_ID_OFFSET                0x0318  /* IcePick Device Identification */
#define TIVA_FCFG1_FCFG1_REVISION_OFFSET                   0x031c  /* Factory Configuration (FCFG1) Revision */
#define TIVA_FCFG1_MISC_OTP_DATA_OFFSET                    0x0320  /* Misc OTP Data */
#define TIVA_FCFG1_IOCONF_OFFSET                           0x0344  /* IO Configuration */
#define TIVA_FCFG1_CONFIG_IF_ADC_OFFSET                    0x034c
#define TIVA_FCFG1_CONFIG_OSC_TOP_OFFSET                   0x0350
#define TIVA_FCFG1_CONFIG_RF_FRONTEND_OFFSET               0x0354
#define TIVA_FCFG1_CONFIG_SYNTH_OFFSET                     0x0358
#define TIVA_FCFG1_SOC_ADC_ABS_GAIN_OFFSET                 0x035c  /* AUX_ADC Gain in Absolute Reference Mode */
#define TIVA_FCFG1_SOC_ADC_REL_GAIN_OFFSET                 0x0360  /* AUX_ADC Gain in Relative Reference Mode */
#define TIVA_FCFG1_SOC_ADC_OFFSET_INT_OFFSET               0x0368  /* AUX_ADC Temperature Offsets in Absolute Reference Mode */
#define TIVA_FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_OFFSET  0x036c
#define TIVA_FCFG1_AMPCOMP_TH1_OFFSET                      0x0370
#define TIVA_FCFG1_AMPCOMP_TH2_OFFSET                      0x0374
#define TIVA_FCFG1_AMPCOMP_CTRL1_OFFSET                    0x0378
#define TIVA_FCFG1_ANABYPASS_VALUE2_OFFSET                 0x037c
#define TIVA_FCFG1_CONFIG_MISC_ADC_OFFSET                  0x0380
#define TIVA_FCFG1_VOLT_TRIM_OFFSET                        0x0388
#define TIVA_FCFG1_OSC_CONF_OFFSET                         0x038c  /* OSC Configuration */
#define TIVA_FCFG1_FREQ_OFFSET_OFFSET                      0x0390
#define TVIA_FCFG1_CAP_TRIM_OFFSET                         0x0394
#define TIVA_FCFG1_MISC_OTP_DATA_1_OFFSET                  0x0398
#define TIVA_FCFG1_PWD_CURR_20C_OFFSET                     0x039c  /* Power Down Current Control 20C */
#define TIVA_FCFG1_PWD_CURR_35C_OFFSET                     0x03a0  /* Power Down Current Control 35C */
#define TIVA_FCFG1_PWD_CURR_50C_OFFSET                     0x03a4  /* Power Down Current Control 50C */
#define TIVA_FCFG1_PWD_CURR_65C_OFFSET                     0x03a8  /* Power Down Current Control 65C */
#define TIVA_FCFG1_PWD_CURR_80C_OFFSET                     0x03ac  /* Power Down Current Control 80C */
#define TIVA_FCFG1_PWD_CURR_95C_OFFSET                     0x03b0  /* Power Down Current Control 95C */
#define TIVA_FCFG1_PWD_CURR_110C_OFFSET                    0x03b4  /* Power Down Current Control 110C */
#define TIVA_FCFG1_PWD_CURR_125C_OFFSET                    0x03b8  /* Power Down Current Control 125C */

