apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_fcfg1.h
/* FCFG1 Register Register Addresses ********************************************************************************/

#define TIVA_FCFG1_MISC_CONF_1                             (TIVA_FCFG1_BASE + TIVA_FCFG1_MISC_CONF_1_OFFSET)
#define TIVA_FCFG1_MISC_CONF_2                             (TIVA_FCFG1_BASE + TIVA_FCFG1_MISC_CONF_2_OFFSET)
#define TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV5                 (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV5_OFFSET)
#define TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV6                 (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV6_OFFSET)
#define TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV10                (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV10_OFFSET)
#define TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV12                (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV12_OFFSET)
#define TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV15                (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV15_OFFSET)
#define TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV30                (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV30_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV5                       (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV5_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV6                       (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV6_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV10                      (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV10_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV12                      (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV12_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV15                      (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV15_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV30                      (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV30_OFFSET)
#define TIVA_FCFG1_CONFIG_MISC_ADC_DIV5                    (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_MISC_ADC_DIV5_OFFSET)
#define TIVA_FCFG1_CONFIG_MISC_ADC_DIV6                    (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_MISC_ADC_DIV6_OFFSET)
#define TIVA_FCFG1_CONFIG_MISC_ADC_DIV10                   (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_MISC_ADC_DIV10_OFFSET)
#define TIVA_FCFG1_CONFIG_MISC_ADC_DIV12                   (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_MISC_ADC_DIV12_OFFSET)
#define TIVA_FCFG1_CONFIG_MISC_ADC_DIV15                   (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_MISC_ADC_DIV15_OFFSET)
#define TIVA_FCFG1_CONFIG_MISC_ADC_DIV30                   (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_MISC_ADC_DIV30_OFFSET)
#define TIVA_FCFG1_SHDW_DIE_ID_0                           (TIVA_FCFG1_BASE + TIVA_FCFG1_SHDW_DIE_ID_0_OFFSET)
#define TIVA_FCFG1_SHDW_DIE_ID_1                           (TIVA_FCFG1_BASE + TIVA_FCFG1_SHDW_DIE_ID_1_OFFSET)
#define TIVA_FCFG1_SHDW_DIE_ID_2                           (TIVA_FCFG1_BASE + TIVA_FCFG1_SHDW_DIE_ID_2_OFFSET)
#define TIVA_FCFG1_SHDW_DIE_ID_3                           (TIVA_FCFG1_BASE + TIVA_FCFG1_SHDW_DIE_ID_3_OFFSET)
#define TIVA_FCFG1_SHDW_OSC_BIAS_LDO_TRIM                  (TIVA_FCFG1_BASE + TIVA_FCFG1_SHDW_OSC_BIAS_LDO_TRIM_OFFSET)
#define TIVA_FCFG1_SHDW_ANA_TRIM                           (TIVA_FCFG1_BASE + TIVA_FCFG1_SHDW_ANA_TRIM_OFFSET)
#define TIVA_FCFG1_FLASH_NUMBER                            (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_NUMBER_OFFSET)
#define TIVA_FCFG1_FLASH_COORDINATE                        (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_COORDINATE_OFFSET)
#define TIVA_FCFG1_FLASH_E_P                               (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_E_P_OFFSET)
#define TIVA_FCFG1_FLASH_C_E_P_R                           (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_C_E_P_R_OFFSET)
#define TIVA_FCFG1_FLASH_P_R_PV                            (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_P_R_PV_OFFSET)
#define TIVA_FCFG1_FLASH_EH_SEQ                            (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_EH_SEQ_OFFSET)
#define TIVA_FCFG1_FLASH_VHV_E                             (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_VHV_E_OFFSET)
#define TIVA_FCFG1_FLASH_PP                                (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_PP_OFFSET)
#define TIVA_FCFG1_FLASH_PROG_EP                           (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_PROG_EP_OFFSET)
#define TIVA_FCFG1_FLASH_ERA_PW                            (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_ERA_PW_OFFSET)
#define TIVA_FCFG1_FLASH_VHV                               (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_VHV_OFFSET)
#define TIVA_FCFG1_FLASH_VHV_PV                            (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_VHV_PV_OFFSET)
#define TIVA_FCFG1_FLASH_V                                 (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_V_OFFSET)
#define TIVA_FCFG1_USER_ID                                 (TIVA_FCFG1_BASE + TIVA_FCFG1_USER_ID_OFFSET)
#define TIVA_FCFG1_FLASH_OTP_DATA3                         (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_OTP_DATA3_OFFSET)
#define TIVA_FCFG1_ANA2_TRIM                               (TIVA_FCFG1_BASE + TIVA_FCFG1_ANA2_TRIM_OFFSET)
#define TIVA_FCFG1_LDO_TRIM                                (TIVA_FCFG1_BASE + TIVA_FCFG1_LDO_TRIM_OFFSET)
#define TIVA_FCFG1_BAT_RC_LDO_TRIM                         (TIVA_FCFG1_BASE + TIVA_FCFG1_BAT_RC_LDO_TRIM_OFFSET)
#define TIVA_FCFG1_MAC_BLE_0                               (TIVA_FCFG1_BASE + TIVA_FCFG1_MAC_BLE_0_OFFSET)
#define TIVA_FCFG1_MAC_BLE_1                               (TIVA_FCFG1_BASE + TIVA_FCFG1_MAC_BLE_1_OFFSET)
#define TIVA_FCFG1_MAC_15_4_0                              (TIVA_FCFG1_BASE + TIVA_FCFG1_MAC_15_4_0_OFFSET)
#define TIVA_FCFG1_MAC_15_4_1                              (TIVA_FCFG1_BASE + TIVA_FCFG1_MAC_15_4_1_OFFSET)
#define TIVA_FCFG1_FLASH_OTP_DATA4                         (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_OTP_DATA4_OFFSET)
#define TIVA_FCFG1_MISC_TRIM                               (TIVA_FCFG1_BASE + TIVA_FCFG1_MISC_TRIM_OFFSET)
#define TIVA_FCFG1_RCOSC_HF_TEMPCOMP                       (TIVA_FCFG1_BASE + TIVA_FCFG1_RCOSC_HF_TEMPCOMP_OFFSET)
#define TIVA_FCFG1_TRIM_CAL_REVISION                       (TIVA_FCFG1_BASE + TIVA_FCFG1_TRIM_CAL_REVISION_OFFSET)
#define TIVA_FCFG1_ICEPICK_DEVICE_ID                       (TIVA_FCFG1_BASE + TIVA_FCFG1_ICEPICK_DEVICE_ID_OFFSET)
#define TIVA_FCFG1_FCFG1_REVISION                          (TIVA_FCFG1_BASE + TIVA_FCFG1_FCFG1_REVISION_OFFSET)
#define TIVA_FCFG1_MISC_OTP_DATA                           (TIVA_FCFG1_BASE + TIVA_FCFG1_MISC_OTP_DATA_OFFSET)
#define TIVA_FCFG1_IOCONF                                  (TIVA_FCFG1_BASE + TIVA_FCFG1_IOCONF_OFFSET)
#define TIVA_FCFG1_CONFIG_IF_ADC                           (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_IF_ADC_OFFSET)
#define TIVA_FCFG1_CONFIG_OSC_TOP                          (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_OSC_TOP_OFFSET)
#define TIVA_FCFG1_CONFIG_RF_FRONTEND                      (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_RF_FRONTEND_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH                            (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_OFFSET)
#define TIVA_FCFG1_SOC_ADC_ABS_GAIN                        (TIVA_FCFG1_BASE + TIVA_FCFG1_SOC_ADC_ABS_GAIN_OFFSET)
#define TIVA_FCFG1_SOC_ADC_REL_GAIN                        (TIVA_FCFG1_BASE + TIVA_FCFG1_SOC_ADC_REL_GAIN_OFFSET)
#define TIVA_FCFG1_SOC_ADC_OFFSET_INT                      (TIVA_FCFG1_BASE + TIVA_FCFG1_SOC_ADC_OFFSET_INT_OFFSET)
#define TIVA_FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT         (TIVA_FCFG1_BASE + TIVA_FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_OFFSET)
#define TIVA_FCFG1_AMPCOMP_TH1                             (TIVA_FCFG1_BASE + TIVA_FCFG1_AMPCOMP_TH1_OFFSET)
#define TIVA_FCFG1_AMPCOMP_TH2                             (TIVA_FCFG1_BASE + TIVA_FCFG1_AMPCOMP_TH2_OFFSET)
#define TIVA_FCFG1_AMPCOMP_CTRL1                           (TIVA_FCFG1_BASE + TIVA_FCFG1_AMPCOMP_CTRL1_OFFSET)
#define TIVA_FCFG1_ANABYPASS_VALUE2                        (TIVA_FCFG1_BASE + TIVA_FCFG1_ANABYPASS_VALUE2_OFFSET)
#define TIVA_FCFG1_CONFIG_MISC_ADC                         (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_MISC_ADC_OFFSET)
#define TIVA_FCFG1_VOLT_TRIM                               (TIVA_FCFG1_BASE + TIVA_FCFG1_VOLT_TRIM_OFFSET)
#define TIVA_FCFG1_OSC_CONF                                (TIVA_FCFG1_BASE + TIVA_FCFG1_OSC_CONF_OFFSET)
#define TIVA_FCFG1_FREQ_OFFSET                             (TIVA_FCFG1_BASE + TIVA_FCFG1_FREQ_OFFSET_OFFSET)
#define TVIA_FCFG1_CAP_TRIM                                (TIVA_FCFG1_BASE + TVIA_FCFG1_CAP_TRIM_OFFSET)
#define TIVA_FCFG1_MISC_OTP_DATA_1                         (TIVA_FCFG1_BASE + TIVA_FCFG1_MISC_OTP_DATA_1_OFFSET)
#define TIVA_FCFG1_PWD_CURR_20C                            (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_20C_OFFSET)
#define TIVA_FCFG1_PWD_CURR_35C                            (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_35C_OFFSET)
#define TIVA_FCFG1_PWD_CURR_50C                            (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_50C_OFFSET)
#define TIVA_FCFG1_PWD_CURR_65C                            (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_65C_OFFSET)
#define TIVA_FCFG1_PWD_CURR_80C                            (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_80C_OFFSET)
#define TIVA_FCFG1_PWD_CURR_95C                            (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_95C_OFFSET)
#define TIVA_FCFG1_PWD_CURR_110C                           (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_110C_OFFSET)
#define TIVA_FCFG1_PWD_CURR_125C                           (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_125C_OFFSET)

