apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_fcfg1.h
/* FCFG1 Bitfield Definitions ***************************************************************************************/

/* TIVA_FCFG1_MISC_CONF_1 */

#define FCFG1_MISC_CONF_1_DEVICE_MINOR_REV_SHIFT           (0)        /* Bits 0-7: HW minor revision number */
#define FCFG1_MISC_CONF_1_DEVICE_MINOR_REV_MASK            (0xff << FCFG1_MISC_CONF_1_DEVICE_MINOR_REV_SHIFT)
#  define FCFG1_MISC_CONF_1_DEVICE_MINOR_REV(n)            ((uint32_t)(n) << FCFG1_MISC_CONF_1_DEVICE_MINOR_REV_SHIFT)

/* TIVA_FCFG1_MISC_CONF_2 */

#define FCFG1_MISC_CONF_2_HPOSC_COMP_P3_SHIFT              (0)        /* Bits 0-7 */
#define FCFG1_MISC_CONF_2_HPOSC_COMP_P3_MASK               (0xff << FCFG1_MISC_CONF_2_HPOSC_COMP_P3_SHIFT)
#  define FCFG1_MISC_CONF_2_HPOSC_COMP_P3(n)               ((uint32_t)(n) << FCFG1_MISC_CONF_2_HPOSC_COMP_P3_SHIFT)

/* TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP */

#define FCFG1_CONFIG_RF_FRONTEND_DIV5_RFLDO_TRIM_OUTPUT_SHIFT  (0)        /* Bits 0-6 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_RFLDO_TRIM_OUTPUT_MASK   (0x7f << FCFG1_CONFIG_RF_FRONTEND_DIV5_RFLDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV5_RFLDO_TRIM_OUTPUT(n)   ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV5_RFLDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_CTL_PA0_TRIM_SHIFT (14)       /* Bits 14-18 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_CTL_PA0_TRIM_MASK  (31 << FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_CTL_PA0_TRIM_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_CTL_PA0_TRIM(n)  ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_CTL_PA0_TRIM_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_IFAMP_TRIM_SHIFT   (19)       /* Bits 19-23 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_IFAMP_TRIM_MASK    (31 << FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_IFAMP_TRIM_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_IFAMP_TRIM(n)    ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_IFAMP_TRIM_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_LNA_IB_SHIFT       (24)       /* Bits 24-27 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_LNA_IB_MASK        (15 << FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_LNA_IB_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_LNA_IB(n)        ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_LNA_IB_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_IFAMP_IB_SHIFT     (28)       /* Bits 28-31  */
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_IFAMP_IB_MASK      (15 << FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_IFAMP_IB_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_IFAMP_IB(n)      ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_IFAMP_IB_SHIFT)

/* TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV6 */

#define FCFG1_CONFIG_RF_FRONTEND_DIV6_RFLDO_TRIM_OUTPUT_SHIFT  (0)      /* Bits 0-6 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_RFLDO_TRIM_OUTPUT_MASK   (0x7f << FCFG1_CONFIG_RF_FRONTEND_DIV6_RFLDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV6_RFLDO_TRIM_OUTPUT(n)   ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV6_RFLDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_CTL_PA0_TRIM_SHIFT       (14)      /* Bits 14-18 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_CTL_PA0_TRIM_MASK        (31 << FCFG1_CONFIG_RF_FRONTEND_DIV6_CTL_PA0_TRIM_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV6_CTL_PA0_TRIM(n)        ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV6_CTL_PA0_TRIM_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_IFAMP_TRIM_SHIFT         (19)      /* Bits 19-23 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_IFAMP_TRIM_MASK          (31 << FCFG1_CONFIG_RF_FRONTEND_DIV6_IFAMP_TRIM_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV6_IFAMP_TRIM(n)          ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV6_IFAMP_TRIM_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_LNA_IB_SHIFT             (24)      /* Bits 24-27 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_LNA_IB_MASK              (15 << FCFG1_CONFIG_RF_FRONTEND_DIV6_LNA_IB_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV6_LNA_IB(n)              ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV6_LNA_IB_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_IFAMP_IB_SHIFT           (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_IFAMP_IB_MASK            (15 << FCFG1_CONFIG_RF_FRONTEND_DIV6_IFAMP_IB_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV6_IFAMP_IB(n)            ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV6_IFAMP_IB_SHIFT)

/* TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV10 */

#define FCFG1_CONFIG_RF_FRONTEND_DIV10_RFLDO_TRIM_OUTPUT_SHIFT (0)      /* Bits 0-6 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_RFLDO_TRIM_OUTPUT_MASK  (0x7f << FCFG1_CONFIG_RF_FRONTEND_DIV10_RFLDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV10_RFLDO_TRIM_OUTPUT(n)  ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV10_RFLDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_CTL_PA0_TRIM_SHIFT      (14)      /* Bits 14-18 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_CTL_PA0_TRIM_MASK       (31 << FCFG1_CONFIG_RF_FRONTEND_DIV10_CTL_PA0_TRIM_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV10_CTL_PA0_TRIM(n)       ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV10_CTL_PA0_TRIM_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_TRIM_SHIFT        (19)      /* Bits 19-23 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_TRIM_MASK         (31 << FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_TRIM_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_TRIM(n)         ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_TRIM_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_LNA_IB_SHIFT            (24)      /* Bits 24-27 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_LNA_IB_MASK             (15 << FCFG1_CONFIG_RF_FRONTEND_DIV10_LNA_IB_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV10_LNA_IB(n)             ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV10_LNA_IB_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_IB_SHIFT          (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_IB_MASK           (15 << FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_IB_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_IB(n)           ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_IB_SHIFT)

/* TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV12 */

#define FCFG1_CONFIG_RF_FRONTEND_DIV12_RFLDO_TRIM_OUTPUT_SHIFT (0)      /* Bits 0-6 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_RFLDO_TRIM_OUTPUT_MASK  (0x7f << FCFG1_CONFIG_RF_FRONTEND_DIV12_RFLDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV12_RFLDO_TRIM_OUTPUT(n)  ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV12_RFLDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_CTL_PA0_TRIM_SHIFT      (14)      /* Bits 14-18 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_CTL_PA0_TRIM_MASK       (31 << FCFG1_CONFIG_RF_FRONTEND_DIV12_CTL_PA0_TRIM_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV12_CTL_PA0_TRIM(n)       ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV12_CTL_PA0_TRIM_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_IFAMP_TRIM_SHIFT        (19)      /* Bits 19-23 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_IFAMP_TRIM_MASK         (31 << FCFG1_CONFIG_RF_FRONTEND_DIV12_IFAMP_TRIM_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV12_IFAMP_TRIM(n)         ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV12_IFAMP_TRIM_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_LNA_IB_SHIFT            (24)      /* Bits 24-27 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_LNA_IB_MASK             (15 << FCFG1_CONFIG_RF_FRONTEND_DIV12_LNA_IB_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV12_LNA_IB(n)             ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV12_LNA_IB_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_IFAMP_IB_SHIFT          (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_IFAMP_IB_MASK           (15 << FCFG1_CONFIG_RF_FRONTEND_DIV12_IFAMP_IB_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV12_IFAMP_IB(n)           ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_IB_SHIFT)

