apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_fcfg1.h
/* TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV15 */

#define FCFG1_CONFIG_RF_FRONTEND_DIV15_RFLDO_TRIM_OUTPUT_SHIFT (0)      /* Bits 0-6 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_RFLDO_TRIM_OUTPUT_MASK  (0x7f << FCFG1_CONFIG_RF_FRONTEND_DIV15_RFLDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV15_RFLDO_TRIM_OUTPUT(n)  ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV15_RFLDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_CTL_PA0_TRIM_SHIFT      (14)      /* Bits 14-18 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_CTL_PA0_TRIM_MASK       (31 << FCFG1_CONFIG_RF_FRONTEND_DIV15_CTL_PA0_TRIM_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV15_CTL_PA0_TRIM(n)       ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV15_CTL_PA0_TRIM_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_IFAMP_TRIM_SHIFT        (19)      /* Bits 19-23 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_IFAMP_TRIM_MASK         (31 << FCFG1_CONFIG_RF_FRONTEND_DIV15_IFAMP_TRIM_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV15_IFAMP_TRIM(n)         ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV15_IFAMP_TRIM_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_LNA_IB_SHIFT            (24)      /* Bits 24-27 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_LNA_IB_MASK             (15 << FCFG1_CONFIG_RF_FRONTEND_DIV15_LNA_IB_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV15_LNA_IB(n)             ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV15_LNA_IB_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_IFAMP_IB_SHIFT          (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_IFAMP_IB_MASK           (15 << FCFG1_CONFIG_RF_FRONTEND_DIV15_IFAMP_IB_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV15_IFAMP_IB(n)           ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_IB_SHIFT)

/* TIVA_FCFG1_CONFIG_RF_FRONTEND_DIV30 */

#define FCFG1_CONFIG_RF_FRONTEND_DIV30_RFLDO_TRIM_OUTPUT_SHIFT (0)      /* Bits 0-6 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_RFLDO_TRIM_OUTPUT_MASK  (0x7f << FCFG1_CONFIG_RF_FRONTEND_DIV30_RFLDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV30_RFLDO_TRIM_OUTPUT(n)  ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV30_RFLDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_CTL_PA0_TRIM_SHIFT      (14)      /* Bits 14-18 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_CTL_PA0_TRIM_MASK       (31 << FCFG1_CONFIG_RF_FRONTEND_DIV30_CTL_PA0_TRIM_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV30_CTL_PA0_TRIM(n)       ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV30_CTL_PA0_TRIM_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_IFAMP_TRIM_SHIFT        (19)      /* Bits 19-23 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_IFAMP_TRIM_MASK         (31 << FCFG1_CONFIG_RF_FRONTEND_DIV30_IFAMP_TRIM_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV30_IFAMP_TRIM(n)         ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV30_IFAMP_TRIM_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_LNA_IB_SHIFT            (24)      /* Bits 24-27 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_LNA_IB_MASK             (15 << FCFG1_CONFIG_RF_FRONTEND_DIV30_LNA_IB_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV30_LNA_IB(n)             ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV30_LNA_IB_SHIFT)
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_IFAMP_IB_SHIFT          (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_IFAMP_IB_MASK           (15 << FCFG1_CONFIG_RF_FRONTEND_DIV30_IFAMP_IB_SHIFT)
#  define FCFG1_CONFIG_RF_FRONTEND_DIV30_IFAMP_IB(n)           ((uint32_t)(n) << FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_IB_SHIFT)

/* TIVA_FCFG1_CONFIG_SYNTH_DIV5 */

#define FCFG1_CONFIG_SYNTH_DIV5_SLDO_TRIM_OUTPUT_SHIFT     (0)      /* Bits 0-5 */
#define FCFG1_CONFIG_SYNTH_DIV5_SLDO_TRIM_OUTPUT_MASK      (0x3f << FCFG1_CONFIG_SYNTH_DIV5_SLDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV5_SLDO_TRIM_OUTPUT(n)      ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV5_SLDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV5_LDOVCO_TRIM_OUTPUT_SHIFT   (6)      /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV5_LDOVCO_TRIM_OUTPUT_MASK    (0x3f << FCFG1_CONFIG_SYNTH_DIV5_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV5_LDOVCO_TRIM_OUTPUT(n)    ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV5_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0_SHIFT     (12)      /* Bits 12-27: Trim value for RF Core */
#define FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0_MASK      (0xffff << FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0(n)      ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV5_DISABLE_CORNER_CAP         (1 << 28) /* Bit 28 */

/* TIVA_FCFG1_CONFIG_SYNTH_DIV6 */

#define FCFG1_CONFIG_SYNTH_DIV6_SLDO_TRIM_OUTPUT_SHIFT     (0)      /* Bits 0-5 */
#define FCFG1_CONFIG_SYNTH_DIV6_SLDO_TRIM_OUTPUT_MASK      (0x3f << FCFG1_CONFIG_SYNTH_DIV6_SLDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV6_SLDO_TRIM_OUTPUT(n)      ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV6_SLDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV6_LDOVCO_TRIM_OUTPUT_SHIFT   (6)      /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV6_LDOVCO_TRIM_OUTPUT_MASK    (0x3f << FCFG1_CONFIG_SYNTH_DIV6_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV6_LDOVCO_TRIM_OUTPUT(n)    ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV6_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV6_RFC_MDM_DEMIQMC0_SHIFT     (12)      /* Bits 12-27: Trim value for RF Core */
#define FCFG1_CONFIG_SYNTH_DIV6_RFC_MDM_DEMIQMC0_MASK      (0xffff << FCFG1_CONFIG_SYNTH_DIV6_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV6_RFC_MDM_DEMIQMC0(n)      ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV6_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV6_DISABLE_CORNER_CAP         (1 << 28) /* Bit 28 */

/* TIVA_FCFG1_CONFIG_SYNTH_DIV10 */

#define FCFG1_CONFIG_SYNTH_DIV10_SLDO_TRIM_OUTPUT_SHIFT    (0)      /* Bits 0-5 */
#define FCFG1_CONFIG_SYNTH_DIV10_SLDO_TRIM_OUTPUT_MASK     (0x3f << FCFG1_CONFIG_SYNTH_DIV10_SLDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV10_SLDO_TRIM_OUTPUT(n)     ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV10_SLDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV10_LDOVCO_TRIM_OUTPUT_SHIFT  (6)      /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV10_LDOVCO_TRIM_OUTPUT_MASK   (0x3f << FCFG1_CONFIG_SYNTH_DIV10_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV10_LDOVCO_TRIM_OUTPUT(n)   ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV10_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV10_RFC_MDM_DEMIQMC0_SHIFT    (12)      /* Bits 12-27: Trim value for RF Core */
#define FCFG1_CONFIG_SYNTH_DIV10_RFC_MDM_DEMIQMC0_MASK     (0xffff << FCFG1_CONFIG_SYNTH_DIV10_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV10_RFC_MDM_DEMIQMC0(n)     ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV10_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV10_DISABLE_CORNER_CAP        (1 << 28) /* Bit 28 */

/*  FCFG1_CONFIG_SYNTH_DIV12 */

