apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_fcfg1.h
#define FCFG1_CONFIG_SYNTH_DIV12_SLDO_TRIM_OUTPUT_SHIFT    (0)      /* Bits 0-5 */
#define FCFG1_CONFIG_SYNTH_DIV12_SLDO_TRIM_OUTPUT_MASK     (0x3f << FCFG1_CONFIG_SYNTH_DIV12_SLDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV12_SLDO_TRIM_OUTPUT(n)     ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV12_SLDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV12_LDOVCO_TRIM_OUTPUT_SHIFT  (6)      /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV12_LDOVCO_TRIM_OUTPUT_MASK   (0x3f << FCFG1_CONFIG_SYNTH_DIV12_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV12_LDOVCO_TRIM_OUTPUT(n)   ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV12_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV12_RFC_MDM_DEMIQMC0_SHIFT    (12)      /* Bits 12-27: Trim value for RF Core */
#define FCFG1_CONFIG_SYNTH_DIV12_RFC_MDM_DEMIQMC0_MASK     (0xffff << FCFG1_CONFIG_SYNTH_DIV12_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV12_RFC_MDM_DEMIQMC0(n)     ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV12_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV12_DISABLE_CORNER_CAP        (1 << 28) /* Bit 28 */

/* TIVA_FCFG1_CONFIG_SYNTH_DIV15 */

#define FCFG1_CONFIG_SYNTH_DIV15_SLDO_TRIM_OUTPUT_SHIFT    (0)      /* Bits 0-5 */
#define FCFG1_CONFIG_SYNTH_DIV15_SLDO_TRIM_OUTPUT_MASK     (0x3f << FCFG1_CONFIG_SYNTH_DIV15_SLDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV15_SLDO_TRIM_OUTPUT(n)     ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV15_SLDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT_SHIFT  (6)      /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT_MASK   (0x3f << FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT(n)   ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_SHIFT    (12)      /* Bits 12-27: Trim value for RF Core */
#define FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_MASK     (0xffff << FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0(n)     ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV15_DISABLE_CORNER_CAP        (1 << 28) /* Bit 28 */

/* TIVA_FCFG1_CONFIG_SYNTH_DIV30 */

#define FCFG1_CONFIG_SYNTH_DIV30_SLDO_TRIM_OUTPUT_SHIFT    (0)      /* Bits 0-5 */
#define FCFG1_CONFIG_SYNTH_DIV30_SLDO_TRIM_OUTPUT_MASK     (0x3f << FCFG1_CONFIG_SYNTH_DIV30_SLDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV30_SLDO_TRIM_OUTPUT(n)     ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV30_SLDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT_SHIFT  (6)      /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT_MASK   (0x3f << FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT(n)   ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_SHIFT    (12)      /* Bits 12-27: Trim value for RF Core */
#define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_MASK     (0xffff << FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0(n)     ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV30_DISABLE_CORNER_CAP        (1 << 28) /* Bit 28 */

/* TIVA_FCFG1_CONFIG_MISC_ADC_DIV5 */

#define FCFG1_CONFIG_MISC_ADC_DIV5_DACTRIM_SHIFT            (0)       /* Bits 0-5 */
#define FCFG1_CONFIG_MISC_ADC_DIV5_DACTRIM_MASK             (0x3f << FCFG1_CONFIG_MISC_ADC_DIV5_DACTRIM_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV5_DACTRIM(n)             ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV5_DACTRIM_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV5_QUANTCTLTHRES_SHIFT      (6)       /* Bits 6-8 */
#define FCFG1_CONFIG_MISC_ADC_DIV5_QUANTCTLTHRES_MASK       (7 << FCFG1_CONFIG_MISC_ADC_DIV5_QUANTCTLTHRES_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV5_QUANTCTLTHRES(n)       ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV5_QUANTCTLTHRES_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV5_RSSI_OFFSET_SHIFT        (9)      /* Bits 9-16 */
#define FCFG1_CONFIG_MISC_ADC_DIV5_RSSI_OFFSET_MASK         (0xff << FCFG1_CONFIG_MISC_ADC_DIV5_RSSI_OFFSET_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV5_RSSI_OFFSET(n)         ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV5_RSSI_OFFSET_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV5_MIN_ALLOWED_RTRIM_SHIFT  (18)      /* Bits 18-21 */
#define FCFG1_CONFIG_MISC_ADC_DIV5_MIN_ALLOWED_RTRIM_MASK   (15 << FCFG1_CONFIG_MISC_ADC_DIV5_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV5_MIN_ALLOWED_RTRIM(n)    ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV5_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_MISC_ADC_DIV6 */

#define FCFG1_CONFIG_MISC_ADC_DIV6_DACTRIM_SHIFT            (0)       /* Bits 0-5 */
#define FCFG1_CONFIG_MISC_ADC_DIV6_DACTRIM_MASK             (0x3f << FCFG1_CONFIG_MISC_ADC_DIV6_DACTRIM_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV6_DACTRIM(n)             ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV6_DACTRIM_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV6_QUANTCTLTHRES_SHIFT      (6)       /* Bits 6-8 */
#define FCFG1_CONFIG_MISC_ADC_DIV6_QUANTCTLTHRES_MASK       (7 << FCFG1_CONFIG_MISC_ADC_DIV6_QUANTCTLTHRES_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV6_QUANTCTLTHRES(n)       ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV6_QUANTCTLTHRES_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV6_RSSI_OFFSET_SHIFT        (9)      /* Bits 9-16 */
#define FCFG1_CONFIG_MISC_ADC_DIV6_RSSI_OFFSET_MASK         (0xff << FCFG1_CONFIG_MISC_ADC_DIV6_RSSI_OFFSET_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV6_RSSI_OFFSET(n)         ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV6_RSSI_OFFSET_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV6_MIN_ALLOWED_RTRIM_SHIFT  (18)      /* Bits 18-21 */
#define FCFG1_CONFIG_MISC_ADC_DIV6_MIN_ALLOWED_RTRIM_MASK   (15 << FCFG1_CONFIG_MISC_ADC_DIV6_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV6_MIN_ALLOWED_RTRIM(n)    ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV6_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_MISC_ADC_DIV10 */

