apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_fcfg1.h
#define FCFG1_CONFIG_MISC_ADC_DIV10_DACTRIM_SHIFT           (0)       /* Bits 0-5 */
#define FCFG1_CONFIG_MISC_ADC_DIV10_DACTRIM_MASK            (0x3f << FCFG1_CONFIG_MISC_ADC_DIV10_DACTRIM_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV10_DACTRIM(n)            ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV10_DACTRIM_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV10_QUANTCTLTHRES_SHIFT     (6)       /* Bits 6-8 */
#define FCFG1_CONFIG_MISC_ADC_DIV10_QUANTCTLTHRES_MASK      (7 << FCFG1_CONFIG_MISC_ADC_DIV10_QUANTCTLTHRES_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV10_QUANTCTLTHRES(n)      ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV10_QUANTCTLTHRES_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV10_RSSI_OFFSET_SHIFT       (9)      /* Bits 9-16 */
#define FCFG1_CONFIG_MISC_ADC_DIV10_RSSI_OFFSET_MASK        (0xff << FCFG1_CONFIG_MISC_ADC_DIV10_RSSI_OFFSET_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV10_RSSI_OFFSET(n)        ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV10_RSSI_OFFSET_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV10_MIN_ALLOWED_RTRIM_SHIFT (18)      /* Bits 18-21 */
#define FCFG1_CONFIG_MISC_ADC_DIV10_MIN_ALLOWED_RTRIM_MASK  (15 << FCFG1_CONFIG_MISC_ADC_DIV10_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV10_MIN_ALLOWED_RTRIM(n)   ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV10_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_MISC_ADC_DIV12 */

#define FCFG1_CONFIG_MISC_ADC_DIV12_DACTRIM_SHIFT           (0)       /* Bits 0-5 */
#define FCFG1_CONFIG_MISC_ADC_DIV12_DACTRIM_MASK            (0x3f << FCFG1_CONFIG_MISC_ADC_DIV12_DACTRIM_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV12_DACTRIM(n)            ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV12_DACTRIM_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV12_QUANTCTLTHRES_SHIFT     (6)       /* Bits 6-8 */
#define FCFG1_CONFIG_MISC_ADC_DIV12_QUANTCTLTHRES_MASK      (7 << FCFG1_CONFIG_MISC_ADC_DIV12_QUANTCTLTHRES_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV12_QUANTCTLTHRES(n)      ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV12_QUANTCTLTHRES_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV12_RSSI_OFFSET_SHIFT       (9)      /* Bits 9-16 */
#define FCFG1_CONFIG_MISC_ADC_DIV12_RSSI_OFFSET_MASK        (0xff << FCFG1_CONFIG_MISC_ADC_DIV12_RSSI_OFFSET_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV12_RSSI_OFFSET(n)        ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV12_RSSI_OFFSET_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV12_MIN_ALLOWED_RTRIM_SHIFT (18)      /* Bits 18-21 */
#define FCFG1_CONFIG_MISC_ADC_DIV12_MIN_ALLOWED_RTRIM_MASK  (15 << FCFG1_CONFIG_MISC_ADC_DIV12_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV12_MIN_ALLOWED_RTRIM(n)   ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV12_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_MISC_ADC_DIV15 */

#define FCFG1_CONFIG_MISC_ADC_DIV15_DACTRIM_SHIFT           (0)       /* Bits 0-5 */
#define FCFG1_CONFIG_MISC_ADC_DIV15_DACTRIM_MASK            (0x3f << FCFG1_CONFIG_MISC_ADC_DIV15_DACTRIM_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV15_DACTRIM(n)            ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV15_DACTRIM_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV15_QUANTCTLTHRES_SHIFT     (6)       /* Bits 6-8 */
#define FCFG1_CONFIG_MISC_ADC_DIV15_QUANTCTLTHRES_MASK      (7 << FCFG1_CONFIG_MISC_ADC_DIV15_QUANTCTLTHRES_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV15_QUANTCTLTHRES(n)      ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV15_QUANTCTLTHRES_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV15_RSSI_OFFSET_SHIFT       (9)      /* Bits 9-16 */
#define FCFG1_CONFIG_MISC_ADC_DIV15_RSSI_OFFSET_MASK        (0xff << FCFG1_CONFIG_MISC_ADC_DIV15_RSSI_OFFSET_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV15_RSSI_OFFSET(n)        ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV15_RSSI_OFFSET_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV15_MIN_ALLOWED_RTRIM_SHIFT (18)      /* Bits 18-21 */
#define FCFG1_CONFIG_MISC_ADC_DIV15_MIN_ALLOWED_RTRIM_MASK  (15 << FCFG1_CONFIG_MISC_ADC_DIV15_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV15_MIN_ALLOWED_RTRIM(n)   ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV15_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_MISC_ADC_DIV30 */

#define FCFG1_CONFIG_MISC_ADC_DIV30_DACTRIM_SHIFT           (0)       /* Bits 0-5 */
#define FCFG1_CONFIG_MISC_ADC_DIV30_DACTRIM_MASK            (0x3f << FCFG1_CONFIG_MISC_ADC_DIV30_DACTRIM_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV30_DACTRIM(n)            ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV30_DACTRIM_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV30_QUANTCTLTHRES_SHIFT     (6)       /* Bits 6-8 */
#define FCFG1_CONFIG_MISC_ADC_DIV30_QUANTCTLTHRES_MASK      (7 << FCFG1_CONFIG_MISC_ADC_DIV30_QUANTCTLTHRES_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV30_QUANTCTLTHRES(n)      ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV30_QUANTCTLTHRES_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV30_RSSI_OFFSET_SHIFT       (9)      /* Bits 9-16 */
#define FCFG1_CONFIG_MISC_ADC_DIV30_RSSI_OFFSET_MASK        (0xff << FCFG1_CONFIG_MISC_ADC_DIV30_RSSI_OFFSET_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV30_RSSI_OFFSET(n)        ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV30_RSSI_OFFSET_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_DIV30_MIN_ALLOWED_RTRIM_SHIFT (18)      /* Bits 18-21 */
#define FCFG1_CONFIG_MISC_ADC_DIV30_MIN_ALLOWED_RTRIM_MASK  (15 << FCFG1_CONFIG_MISC_ADC_DIV30_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DIV30_MIN_ALLOWED_RTRIM(n)   ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DIV30_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_SHDW_DIE_ID_0 (32-bit value, Shadow of the DIE_ID_0 register in eFuse row number 3) */
/* TIVA_FCFG1_SHDW_DIE_ID_1 (32-bit value, Shadow of the DIE_ID_1 register in eFuse row number 4) */
/* TIVA_FCFG1_SHDW_DIE_ID_2 (32-bit value, Shadow of the DIE_ID_2 register in eFuse row number 5) */
/* TIVA_FCFG1_SHDW_DIE_ID_3 (32-bit value,  Shadow of the DIE_ID_3 register in eFuse row number 6) */

/* TIVA_FCFG1_SHDW_OSC_BIAS_LDO_TRIM */

#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM_SHIFT   (0)      /* Bits 0-7 */
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM_MASK    (0xff << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM_SHIFT)
#  define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM(n)    ((uint32_t)(n) << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM_SHIFT)
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE_SHIFT    (8)      /* Bits 8-11 */
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE_MASK     (15 << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE_SHIFT)
#  define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE(n)     ((uint32_t)(n) << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE_SHIFT)
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG_SHIFT       (12)      /* Bits 12-15 */
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG_MASK        (15 << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG_SHIFT)
#  define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG(n)        ((uint32_t)(n) << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG_SHIFT)
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO_SHIFT   (16)      /* Bits 16-17 */
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO_MASK    (3 << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO_SHIFT)
#  define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO(n)    ((uint32_t)(n) << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO_SHIFT)
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF_SHIFT        (18)      /* Bits 18-22 */
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF_MASK         (31 << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF_SHIFT)
#  define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF(n)         ((uint32_t)(n) << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF_SHIFT)
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG_SHIFT         (23)      /* Bits 23-26 */
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG_MASK          (15 << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG_SHIFT)
#  define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG(n)          ((uint32_t)(n) << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG_SHIFT)
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_SET_RCOSC_HF_COARSE_RESISTOR_SHIFT (27)  /* Bits 27-28 */
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_SET_RCOSC_HF_COARSE_RESISTOR_MASK \
  (3 << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_SET_RCOSC_HF_COARSE_RESISTOR_SHIFT)
#  define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_SET_RCOSC_HF_COARSE_RESISTOR(n) \
  ((uint32_t)(n) << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_SET_RCOSC_HF_COARSE_RESISTOR_SHIFT)

/* TIVA_FCFG1_SHDW_ANA_TRIM */

#define FCFG1_SHDW_ANA_TRIM_TRIMTEMP_SHIFT                 (18)      /* Bits 0-5 */
#define FCFG1_SHDW_ANA_TRIM_TRIMTEMP_MASK                  (0x3f << FCFG1_SHDW_ANA_TRIM_TRIMTEMP_SHIFT)
#  define FCFG1_SHDW_ANA_TRIM_TRIMTEMP(n)                  ((uint32_t)(n) << FCFG1_SHDW_ANA_TRIM_TRIMTEMP_SHIFT)
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_EXTMODE_SHIFT          (6)      /* Bits 6-10 */
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_EXTMODE_MASK           (31 << FCFG1_SHDW_ANA_TRIM_TRIMBOD_EXTMODE_SHIFT)
#  define FCFG1_SHDW_ANA_TRIM_TRIMBOD_EXTMODE(n)           ((uint32_t)(n) << FCFG1_SHDW_ANA_TRIM_TRIMBOD_EXTMODE_SHIFT)
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_INTMODE_SHIFT          (11)      /* Bits 11-15 */
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_INTMODE_MASK           (31 << FCFG1_SHDW_ANA_TRIM_TRIMBOD_INTMODE_SHIFT)
#  define FCFG1_SHDW_ANA_TRIM_TRIMBOD_INTMODE(n)           ((uint32_t)(n) << FCFG1_SHDW_ANA_TRIM_TRIMBOD_INTMODE_SHIFT)
#define FCFG1_SHDW_ANA_TRIM_VDDR_TRIM_SHIFT                (16)      /* Bits 16-20 */
#define FCFG1_SHDW_ANA_TRIM_VDDR_TRIM_MASK                 (31 << FCFG1_SHDW_ANA_TRIM_VDDR_TRIM_SHIFT)
#  define FCFG1_SHDW_ANA_TRIM_VDDR_TRIM(n)                 ((uint32_t)(n) << FCFG1_SHDW_ANA_TRIM_VDDR_TRIM_SHIFT)
#define FCFG1_SHDW_ANA_TRIM_IPTAT_TRIM_SHIFT               (21)      /* Bits 21-22 */
#define FCFG1_SHDW_ANA_TRIM_IPTAT_TRIM_MASK                (2 << FCFG1_SHDW_ANA_TRIM_IPTAT_TRIM_SHIFT)
#  define FCFG1_SHDW_ANA_TRIM_IPTAT_TRIM(n)                ((uint32_t)(n) << FCFG1_SHDW_ANA_TRIM_IPTAT_TRIM_SHIFT)
#define FCFG1_SHDW_ANA_TRIM_VDDR_OK_HYS                    (1 << 23) /* Bit 23 */
#define FCFG1_SHDW_ANA_TRIM_VDDR_ENABLE_PG1                (1 << 24) /* Bit 24 */
#define FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_SHIFT     (25)      /* Bits 25-26 */
#define FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_MASK      (3 << FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_SHIFT)
#  define FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF(n)      ((uint32_t)(n) << FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_SHIFT)

/* TIVA_FCFG1_FLASH_NUMBER */

