apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_fcfg1.h
/* TIVA_FCFG1_FLASH_COORDINATE */

#define FCFG1_FLASH_COORDINATE_YCOORDINATE_SHIFT           (0)       /* Bits 0-15: Y coordinate of this unit on the wafer */
#define FCFG1_FLASH_COORDINATE_YCOORDINATE_MASK            (0xffff << FCFG1_FLASH_COORDINATE_YCOORDINATE_SHIFT)
#  define FCFG1_FLASH_COORDINATE_YCOORDINATE(n)            ((uint32_t)(n) << FCFG1_FLASH_COORDINATE_YCOORDINATE_SHIFT)
#define FCFG1_FLASH_COORDINATE_XCOORDINATE_SHIFT           (16)      /* Bits 16-31:  X coordinate of this unit on the wafer */
#define FCFG1_FLASH_COORDINATE_XCOORDINATE_MASK            (0xffff << FCFG1_FLASH_COORDINATE_XCOORDINATE_SHIFT)
#  define FCFG1_FLASH_COORDINATE_XCOORDINATE(n)            ((uint32_t)(n) << FCFG1_FLASH_COORDINATE_XCOORDINATE_SHIFT)

/* TIVA_FCFG1_FLASH_E_P */

#define FCFG1_FLASH_E_P_EVSU_SHIFT                         (0)       /* Bits 0-7 */
#define FCFG1_FLASH_E_P_EVSU_MASK                          (0xff << FCFG1_FLASH_E_P_EVSU_SHIFT)
#  define FCFG1_FLASH_E_P_EVSU(n)                          ((uint32_t)(n) << FCFG1_FLASH_E_P_EVSU_SHIFT)
#define FCFG1_FLASH_E_P_PVSU_SHIFT                         (8)       /* Bits 8-15 */
#define FCFG1_FLASH_E_P_ESU_SHIFT                          (16)      /* Bits 16-23 */
#define FCFG1_FLASH_E_P_ESU_MASK                           (0xff << FCFG1_FLASH_E_P_ESU_SHIFT)
#  define FCFG1_FLASH_E_P_ESU(n)                           ((uint32_t)(n) << FCFG1_FLASH_E_P_ESU_SHIFT)
#define FCFG1_FLASH_E_P_PVSU_MASK                          (0xff << FCFG1_FLASH_E_P_PVSU_SHIFT)
#  define FCFG1_FLASH_E_P_PVSU(n)                          ((uint32_t)(n) << FCFG1_FLASH_E_P_PVSU_SHIFT)
#define FCFG1_FLASH_E_P_PSU_SHIFT                          (24)      /* Bits 24-31 */
#define FCFG1_FLASH_E_P_PSU_MASK                           (0xff << FCFG1_FLASH_E_P_PSU_SHIFT)
#  define FCFG1_FLASH_E_P_PSU(n)                           ((uint32_t)(n) << FCFG1_FLASH_E_P_PSU_SHIFT)

/* TIVA_FCFG1_FLASH_C_E_P_R */

#define FCFG1_FLASH_C_E_P_R_CVSU_SHIFT                     (0)       /* Bits 0-11 */
#define FCFG1_FLASH_C_E_P_R_CVSU_MASK                      (0xfff << FCFG1_FLASH_C_E_P_R_CVSU_SHIFT)
#  define FCFG1_FLASH_C_E_P_R_CVSU(n)                      ((uint32_t)(n) << FCFG1_FLASH_C_E_P_R_CVSU_SHIFT)
#define FCFG1_FLASH_C_E_P_R_A_EXEZ_SETUP_SHIFT             (12)      /* Bits 12-15 */
#define FCFG1_FLASH_C_E_P_R_A_EXEZ_SETUP_MASK              (15 << FCFG1_FLASH_C_E_P_R_A_EXEZ_SETUP_SHIFT)
#  define FCFG1_FLASH_C_E_P_R_A_EXEZ_SETUP(n)              ((uint32_t)(n) << FCFG1_FLASH_C_E_P_R_A_EXEZ_SETUP_SHIFT)
#define FCFG1_FLASH_C_E_P_R_PV_ACCESS_SHIFT                (16)      /* Bits 16-23 */
#define FCFG1_FLASH_C_E_P_R_PV_ACCESS_MASK                 (0xff << FCFG1_FLASH_C_E_P_R_PV_ACCESS_SHIFT)
#  define FCFG1_FLASH_C_E_P_R_PV_ACCESS(n)                 ((uint32_t)(n) << FCFG1_FLASH_C_E_P_R_PV_ACCESS_SHIFT)
#define FCFG1_FLASH_C_E_P_R_RVSU_SHIFT                     (24)      /* Bits 24-31 */
#define FCFG1_FLASH_C_E_P_R_RVSU_MASK                      (0xff << FCFG1_FLASH_C_E_P_R_RVSU_SHIFT)
#  define FCFG1_FLASH_C_E_P_R_RVSU(n)                      ((uint32_t)(n) << FCFG1_FLASH_C_E_P_R_RVSU_SHIFT)

/* TIVA_FCFG1_FLASH_P_R_PV */

#define FCFG1_FLASH_P_R_PV_PVH2_SHIFT                      (0)      /* Bits 0-7 */
#define FCFG1_FLASH_P_R_PV_PVH2_MASK                       (0xff << FCFG1_FLASH_P_R_PV_PVH2_SHIFT)
#  define FCFG1_FLASH_P_R_PV_PVH2(n)                       ((uint32_t)(n) << FCFG1_FLASH_P_R_PV_PVH2_SHIFT)
#define FCFG1_FLASH_P_R_PV_PVH_SHIFT                       (8)      /* Bits 8-15 */
#define FCFG1_FLASH_P_R_PV_PVH_MASK                        (0xff << FCFG1_FLASH_P_R_PV_PVH_SHIFT)
#  define FCFG1_FLASH_P_R_PV_PVH(n)                        ((uint32_t)(n) << FCFG1_FLASH_P_R_PV_PVH_SHIFT)
#define FCFG1_FLASH_P_R_PV_RH_SHIFT                        (16)      /* Bits 16-23 */
#define FCFG1_FLASH_P_R_PV_RH_MASK                         (0xff << FCFG1_FLASH_P_R_PV_RH_SHIFT)
#  define FCFG1_FLASH_P_R_PV_RH(n)                         ((uint32_t)(n) << FCFG1_FLASH_P_R_PV_RH_SHIFT)
#define FCFG1_FLASH_P_R_PV_PH_SHIFT                        (24)      /* Bits 24-31 */
#define FCFG1_FLASH_P_R_PV_PH_MASK                         (0xff << FCFG1_FLASH_P_R_PV_PH_SHIFT)
#  define FCFG1_FLASH_P_R_PV_PH(n)                         ((uint32_t)(n) << FCFG1_FLASH_P_R_PV_PH_SHIFT)

/* TIVA_FCFG1_FLASH_EH_SEQ */

#define FCFG1_FLASH_EH_SEQ_SM_FREQUENCY_SHIFT              (0)       /* Bits 0-11 */
#define FCFG1_FLASH_EH_SEQ_SM_FREQUENCY_MASK               (0xfff << FCFG1_FLASH_EH_SEQ_SM_FREQUENCY_SHIFT)
#  define FCFG1_FLASH_EH_SEQ_SM_FREQUENCY(n)               ((uint32_t)(n) << FCFG1_FLASH_EH_SEQ_SM_FREQUENCY_SHIFT)
#define FCFG1_FLASH_EH_SEQ_VSTAT_SHIFT                     (12)      /* Bits 12-15 */
#define FCFG1_FLASH_EH_SEQ_VSTAT_MASK                      (15 << FCFG1_FLASH_EH_SEQ_VSTAT_SHIFT)
#  define FCFG1_FLASH_EH_SEQ_VSTAT(n)                      ((uint32_t)(n) << FCFG1_FLASH_EH_SEQ_VSTAT_SHIFT)
#define FCFG1_FLASH_EH_SEQ_SEQ_SHIFT                       (16)      /* Bits 16-23 */
#define FCFG1_FLASH_EH_SEQ_SEQ_MASK                        (0xff << FCFG1_FLASH_EH_SEQ_SEQ_SHIFT)
#  define FCFG1_FLASH_EH_SEQ_SEQ(n)                        ((uint32_t)(n) << FCFG1_FLASH_EH_SEQ_SEQ_SHIFT)
#define FCFG1_FLASH_EH_SEQ_EH_SHIFT                        (24)      /* Bits 24-31 */
#define FCFG1_FLASH_EH_SEQ_EH_MASK                         (0xff << FCFG1_FLASH_EH_SEQ_EH_SHIFT)
#  define FCFG1_FLASH_EH_SEQ_EH(n)                         ((uint32_t)(n) << FCFG1_FLASH_EH_SEQ_EH_SHIFT)

/* TIVA_FCFG1_FLASH_VHV_E */

#define FCFG1_FLASH_VHV_E_VHV_E_STEP_HIGHT_SHIFT           (0)       /* Bits 0-15 */
#define FCFG1_FLASH_VHV_E_VHV_E_STEP_HIGHT_MASK            (0xffff << FCFG1_FLASH_VHV_E_VHV_E_STEP_HIGHT_SHIFT)
#  define FCFG1_FLASH_VHV_E_VHV_E_STEP_HIGHT(n)            ((uint32_t)(n) << FCFG1_FLASH_VHV_E_VHV_E_STEP_HIGHT_SHIFT)
#define FCFG1_FLASH_VHV_E_VHV_E_START_SHIFT                (16)      /* Bits 16-31 */
#define FCFG1_FLASH_VHV_E_VHV_E_START_MASK                 (0xffff << FCFG1_FLASH_VHV_E_VHV_E_START_SHIFT)
#  define FCFG1_FLASH_VHV_E_VHV_E_START(n)                 ((uint32_t)(n) << FCFG1_FLASH_VHV_E_VHV_E_START_SHIFT)

