apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_fcfg1.h
/* TIVA_FCFG1_FLASH_PP */

#define FCFG1_FLASH_PP_MAX_PP_SHIFT                        (0)       /* Bits 0-15 */
#define FCFG1_FLASH_PP_MAX_PP_MASK                         (0xffff << FCFG1_FLASH_PP_MAX_PP_SHIFT)
#  define FCFG1_FLASH_PP_MAX_PP(n)                         ((uint32_t)(n) << FCFG1_FLASH_PP_MAX_PP_SHIFT)
#define FCFG1_FLASH_PP_PUMP_SU_SHIFT                       (24)      /* Bits 24-31 */
#define FCFG1_FLASH_PP_PUMP_SU_MASK                        (0xff << FCFG1_FLASH_PP_PUMP_SU_SHIFT)
#  define FCFG1_FLASH_PP_PUMP_SU(n)                        ((uint32_t)(n) << FCFG1_FLASH_PP_PUMP_SU_SHIFT)

/* TIVA_FCFG1_FLASH_PROG_EP */

#define FCFG1_FLASH_PROG_EP_PROGRAM_PW_SHIFT               (0)       /* Bits 0-15 */
#define FCFG1_FLASH_PROG_EP_PROGRAM_PW_MASK                (0xffff << FCFG1_FLASH_PROG_EP_PROGRAM_PW_SHIFT)
#  define FCFG1_FLASH_PROG_EP_PROGRAM_PW(n)                ((uint32_t)(n) << FCFG1_FLASH_PROG_EP_PROGRAM_PW_SHIFT)
#define FCFG1_FLASH_PROG_EP_MAX_EP_SHIFT                   (16)      /* Bits 16-31 */
#define FCFG1_FLASH_PROG_EP_MAX_EP_MASK                    (0xffff << FCFG1_FLASH_PROG_EP_MAX_EP_SHIFT)
#  define FCFG1_FLASH_PROG_EP_MAX_EP(n)                    ((uint32_t)(n) << FCFG1_FLASH_PROG_EP_MAX_EP_SHIFT)

/* TIVA_FCFG1_FLASH_ERA_PW (32-bit value) */

/* TIVA_FCFG1_FLASH_VHV */

#define FCFG1_FLASH_VHV_VHV_E_SHIFT                        (0)       /* Bits 0-3 */
#define FCFG1_FLASH_VHV_VHV_E_MASK                         (15 << FCFG1_FLASH_VHV_VHV_E_SHIFT)
#  define FCFG1_FLASH_VHV_VHV_E(n)                         ((uint32_t)(n) << FCFG1_FLASH_VHV_VHV_E_SHIFT)
#define FCFG1_FLASH_VHV_TRIM13_E_SHIFT                     (8)       /* Bits 8-11 */
#define FCFG1_FLASH_VHV_TRIM13_E_MASK                      (15 << FCFG1_FLASH_VHV_TRIM13_E_SHIFT)
#  define FCFG1_FLASH_VHV_TRIM13_E(n)                      ((uint32_t)(n) << FCFG1_FLASH_VHV_TRIM13_E_SHIFT)
#define FCFG1_FLASH_VHV_VHV_P_SHIFT                        (16)      /* Bits 16-19 */
#define FCFG1_FLASH_VHV_VHV_P_MASK                         (15 << FCFG1_FLASH_VHV_VHV_P_SHIFT)
#  define FCFG1_FLASH_VHV_VHV_P(n)                         ((uint32_t)(n) << FCFG1_FLASH_VHV_VHV_P_SHIFT)
#define FCFG1_FLASH_VHV_TRIM13_P_SHIFT                     (24)      /* Bits 24-27 */
#define FCFG1_FLASH_VHV_TRIM13_P_MASK                      (15 << FCFG1_FLASH_VHV_TRIM13_P_SHIFT)
#  define FCFG1_FLASH_VHV_TRIM13_P(n)                      ((uint32_t)(n) << FCFG1_FLASH_VHV_TRIM13_P_SHIFT)

/* TIVA_FCFG1_FLASH_VHV_PV */

#define FCFG1_FLASH_VHV_PV_VINH_SHIFT                      (0)       /* Bits 0-7 */
#define FCFG1_FLASH_VHV_PV_VINH_MASK                       (0xff << FCFG1_FLASH_VHV_PV_VINH_SHIFT)
#  define FCFG1_FLASH_VHV_PV_VINH(n)                       ((uint32_t)(n) << FCFG1_FLASH_VHV_PV_VINH_SHIFT)
#define FCFG1_FLASH_VHV_PV_VCG2P5_SHIFT                    (8)       /* Bits 8-15 */
#define FCFG1_FLASH_VHV_PV_VCG2P5_MASK                     (0xff << FCFG1_FLASH_VHV_PV_VCG2P5_SHIFT)
#  define FCFG1_FLASH_VHV_PV_VCG2P5(n)                     ((uint32_t)(n) << FCFG1_FLASH_VHV_PV_VCG2P5_SHIFT)
#define FCFG1_FLASH_VHV_PV_VHV_PV_SHIFT                    (16)      /* Bits 16-19 */
#define FCFG1_FLASH_VHV_PV_VHV_PV_MASK                     (15 << FCFG1_FLASH_VHV_PV_VHV_PV_SHIFT)
#  define FCFG1_FLASH_VHV_PV_VHV_PV(n)                     ((uint32_t)(n) << FCFG1_FLASH_VHV_PV_VHV_PV_SHIFT)
#define FCFG1_FLASH_VHV_PV_TRIM13_PV_SHIFT                 (24)      /* Bits 24-27 */
#define FCFG1_FLASH_VHV_PV_TRIM13_PV_MASK                  (15 << FCFG1_FLASH_VHV_PV_TRIM13_PV_SHIFT)
#  define FCFG1_FLASH_VHV_PV_TRIM13_PV(n)                  ((uint32_t)(n) << FCFG1_FLASH_VHV_PV_TRIM13_PV_SHIFT)

/* TIVA_FCFG1_FLASH_V */

#define FCFG1_FLASH_V_V_READ_SHIFT                         (8)       /* Bits 8-15 */
#define FCFG1_FLASH_V_V_READ_MASK                          (0xff << FCFG1_FLASH_V_V_READ_SHIFT)
#  define FCFG1_FLASH_V_V_READ(n)                          ((uint32_t)(n) << FCFG1_FLASH_V_V_READ_SHIFT)
#define FCFG1_FLASH_V_VWL_P_SHIFT                          (16)      /* Bits 16-23 */
#define FCFG1_FLASH_V_VWL_P_MASK                           (0xff << FCFG1_FLASH_V_VWL_P_SHIFT)
#  define FCFG1_FLASH_V_VWL_P(n)                           ((uint32_t)(n) << FCFG1_FLASH_V_VWL_P_SHIFT)
#define FCFG1_FLASH_V_VSL_P_SHIFT                          (24)      /* Bits 24-31 */
#define FCFG1_FLASH_V_VSL_P_MASK                           (0xff << FCFG1_FLASH_V_VSL_P_SHIFT)
#  define FCFG1_FLASH_V_VSL_P(n)                           ((uint32_t)(n) << FCFG1_FLASH_V_VSL_P_SHIFT)

/* TIVA_FCFG1_USER_ID */

#define FCFG1_USER_ID_PROTOCOL_SHIFT                       (12)      /* Bits 12-15: Protocols supported */
#define FCFG1_USER_ID_PROTOCOL_MASK                        (15 << FCFG1_USER_ID_PROTOCOL_SHIFT)
#  define FCFG1_USER_ID_PROTOCOL_BLE                       (0 << FCFG1_USER_ID_PROTOCOL_SHIFT) /* BLE */
#  define FCFG1_USER_ID_PROTOCOL_RF4CE                     (2 << FCFG1_USER_ID_PROTOCOL_SHIFT) /* RF4CE */
#  define FCFG1_USER_ID_PROTOCOL_802154                    (4 << FCFG1_USER_ID_PROTOCOL_SHIFT) /* Zigbee/6lowpan */
#  define FCFG1_USER_ID_PROTOCOL_PROP                      (8 << FCFG1_USER_ID_PROTOCOL_SHIFT) /* Proprietary */
#define FCFG1_USER_ID_PKG_SHIFT                            (16)      /* Bits 16-18: Package type */
#define FCFG1_USER_ID_PKG_MASK                             (7 << FCFG1_USER_ID_PKG_SHIFT)
#  define FCFG1_USER_ID_PKG_RHG                            (0 << FCFG1_USER_ID_PKG_SHIFT) /* 4x4mm QFN (RHB) package */
#  define FCFG1_USER_ID_PKG_RSM                            (1 << FCFG1_USER_ID_PKG_SHIFT) /* 5x5mm QFN (RSM) package */
#  define FCFG1_USER_ID_PKG_RGZ                            (2 << FCFG1_USER_ID_PKG_SHIFT) /* 7x7mm QFN (RGZ) package */
#  define FCFG1_USER_ID_PKG_WSP                            (3 << FCFG1_USER_ID_PKG_SHIFT) /* Wafer sale package (naked die) */
#  define FCFG1_USER_ID_PKG_QFNWF                          (5 << FCFG1_USER_ID_PKG_SHIFT) /* 7x7mm QFN package with Wettable Flanks */
#define FCFG1_USER_ID_SEQUENCE_SHIFT                       (19)      /* Bits 19-22: Sequence */
#define FCFG1_USER_ID_SEQUENCE_MASK                        (15 << FCFG1_USER_ID_SEQUENCE_SHIFT)
#  define FCFG1_USER_ID_SEQUENCE(n)                        ((uint32_t)(n) << FCFG1_USER_ID_SEQUENCE_SHIFT)
#define FCFG1_USER_ID_VER_SHIFT                            (26)      /* Bits 26-27: Version number encoding */
#define FCFG1_USER_ID_VER_MASK                             (3 << FCFG1_USER_ID_VER_SHIFT)
#  define FCFG1_USER_ID_VER(n)                             ((uint32_t)(n) << FCFG1_USER_ID_VER_SHIFT)
#define FCFG1_USER_ID_PG_REV_SHIFT                         (28)      /* Bits 28-31: Revision of the device */
#define FCFG1_USER_ID_PG_REV_MASK                          (15 << FCFG1_USER_ID_PG_REV_SHIFT)
#  define FCFG1_USER_ID_PG_REV(n)                          ((uint32_t)(n) << FCFG1_USER_ID_PG_REV_SHIFT)

/* TIVA_FCFG1_FLASH_OTP_DATA3 */

#define FCFG1_FLASH_OTP_DATA3_WAIT_SYSCODE_SHIFT           (0)      /* Bits 9-7 */
#define FCFG1_FLASH_OTP_DATA3_WAIT_SYSCODE_MASK            (0xff << FCFG1_FLASH_OTP_DATA3_WAIT_SYSCODE_SHIFT)
#  define FCFG1_FLASH_OTP_DATA3_WAIT_SYSCODE(n)            ((uint32_t)(n) << FCFG1_FLASH_OTP_DATA3_WAIT_SYSCODE_SHIFT)
#define FCFG1_FLASH_OTP_DATA3_FLASH_SIZE_SHIFT             (8)      /* Bits 8-15 */
#define FCFG1_FLASH_OTP_DATA3_FLASH_SIZE_MASK              (0xff << FCFG1_FLASH_OTP_DATA3_FLASH_SIZE_SHIFT)
#  define FCFG1_FLASH_OTP_DATA3_FLASH_SIZE(n)              ((uint32_t)(n) << FCFG1_FLASH_OTP_DATA3_FLASH_SIZE_SHIFT)
#define FCFG1_FLASH_OTP_DATA3_TRIM_1P7_SHIFT               (16)      /* Bits 16-17 */
#define FCFG1_FLASH_OTP_DATA3_TRIM_1P7_MASK                (3 << FCFG1_FLASH_OTP_DATA3_TRIM_1P7_SHIFT)
#  define FCFG1_FLASH_OTP_DATA3_TRIM_1P7(n)                ((uint32_t)(n) << FCFG1_FLASH_OTP_DATA3_TRIM_1P7_SHIFT)
#define FCFG1_FLASH_OTP_DATA3_MAX_EC_LEVEL_SHIFT           (18)      /* Bits 18-21 */
#define FCFG1_FLASH_OTP_DATA3_MAX_EC_LEVEL_MASK            (15 << FCFG1_FLASH_OTP_DATA3_MAX_EC_LEVEL_SHIFT)
#  define FCFG1_FLASH_OTP_DATA3_MAX_EC_LEVEL(n)            ((uint32_t)(n) << FCFG1_FLASH_OTP_DATA3_MAX_EC_LEVEL_SHIFT)
#define FCFG1_FLASH_OTP_DATA3_DO_PRECOND                   (1 << 22) /* Bit 22 */
#define FCFG1_FLASH_OTP_DATA3_EC_STEP_SIZE_SHIFT           (23)      /* Bits 23-31 */
#define FCFG1_FLASH_OTP_DATA3_EC_STEP_SIZE_MASK            (0x1ff << FCFG1_FLASH_OTP_DATA3_EC_STEP_SIZE_SHIFT)
#  define FCFG1_FLASH_OTP_DATA3_EC_STEP_SIZE(n)            ((uint32_t)(n) << FCFG1_FLASH_OTP_DATA3_EC_STEP_SIZE_SHIFT)

/* TIVA_FCFG1_ANA2_TRIM */

