apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_fcfg1.h
#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_SHIFT         (2)       /* Bits 2-7 */
#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_MASK          (0x3f << FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_SHIFT)
#  define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM(n)          ((uint32_t)(n) << FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_SHIFT)
#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_SHIFT         (10)      /* Bits 10-15 */
#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_MASK          (0x3f << FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_SHIFT)
#  define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM(n)          ((uint32_t)(n) << FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_SHIFT)
#define FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM_SHIFT              (18)      /* Bits 18-23 */
#define FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM_MASK               (0x3f << FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM_SHIFT)
#  define FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM(n)               ((uint32_t)(n) << FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM_SHIFT)
#define FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH_SHIFT              (26)      /* Bits 26-31 */
#define FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH_MASK               (0x3f << FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH_SHIFT)
#  define FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH(n)               ((uint32_t)(n) << FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH_SHIFT)

/* TIVA_FCFG1_AMPCOMP_CTRL1 */

#define FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_SHIFT   (0)       /* Bits 0-3 */
#define FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_MASK    (15 << FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_SHIFT)
#  define FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT(n)    ((uint32_t)(n) << FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_SHIFT)
#define FCFG1_AMPCOMP_CTRL1_CAP_STEP_SHIFT                 (4)       /* Bits 4-7 */
#define FCFG1_AMPCOMP_CTRL1_CAP_STEP_MASK                  (15 << FCFG1_AMPCOMP_CTRL1_CAP_STEP_SHIFT)
#  define FCFG1_AMPCOMP_CTRL1_CAP_STEP(n)                  ((uint32_t)(n) << FCFG1_AMPCOMP_CTRL1_CAP_STEP_SHIFT)
#define FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_SHIFT (8)       /* Bits 8-15 */
#define FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_MASK  (0xff << FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_SHIFT)
#  define FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL(n)  ((uint32_t)(n) << FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_SHIFT)
#define FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_SHIFT               (16)      /* Bits 16-19 */
#define FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_MASK                (15 << FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_SHIFT)
#  define FCFG1_AMPCOMP_CTRL1_IBIAS_INIT(n)                ((uint32_t)(n) << FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_SHIFT)
#define FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_SHIFT             (20)      /* Bits 20-23 */
#define FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_MASK              (15 << FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_SHIFT)
#  define FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET(n)              ((uint32_t)(n) << FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_SHIFT)
#define FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE               (1 << 30) /* Bit 30 */

/* TIVA_FCFG1_ANABYPASS_VALUE2 */

#define FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_SHIFT    (0)       /* Bits 0-13 */
#define FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_MASK     (0x3fff << FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_SHIFT)
#  define FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM(n)     ((uint32_t)(n) << FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_SHIFT)

/* TIVA_FCFG1_CONFIG_MISC_ADC */

#define FCFG1_CONFIG_MISC_ADC_DACTRIM_SHIFT                (0)      /* Bits 0-5 */
#define FCFG1_CONFIG_MISC_ADC_DACTRIM_MASK                 (0x3f << FCFG1_CONFIG_MISC_ADC_DACTRIM_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_DACTRIM(n)                 ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_DACTRIM_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_QUANTCTLTHRES_SHIFT          (6)      /* Bits 6-8 */
#define FCFG1_CONFIG_MISC_ADC_QUANTCTLTHRES_MASK           (15 << FCFG1_CONFIG_MISC_ADC_QUANTCTLTHRES_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_QUANTCTLTHRES(n)           ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_QUANTCTLTHRES_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_RSSI_OFFSET_SHIFT            (9)      /* Bits 9-16 */
#define FCFG1_CONFIG_MISC_ADC_RSSI_OFFSET_MASK             (0xff << FCFG1_CONFIG_MISC_ADC_RSSI_OFFSET_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_RSSI_OFFSET(n)             ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_RSSI_OFFSET_SHIFT)
#define FCFG1_CONFIG_MISC_ADC_RSSITRIMCOMPLETE_N           (1 << 17) /* Bit 17 */
#define FCFG1_CONFIG_MISC_ADC_MIN_ALLOWED_RTRIM_SHIFT      (18)      /* Bits 18-21 */
#define FCFG1_CONFIG_MISC_ADC_MIN_ALLOWED_RTRIM_MASK       (15 << FCFG1_CONFIG_MISC_ADC_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_MISC_ADC_MIN_ALLOWED_RTRIM(n)       ((uint32_t)(n) << FCFG1_CONFIG_MISC_ADC_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_VOLT_TRIM */

#define FCFG1_VOLT_TRIM_TRIMBOD_H_SHIFT                    (0)       /* Bits 0-4 */
#define FCFG1_VOLT_TRIM_TRIMBOD_H_MASK                     (31 << FCFG1_VOLT_TRIM_TRIMBOD_H_SHIFT)
#  define FCFG1_VOLT_TRIM_TRIMBOD_H(n)                     ((uint32_t)(n) << FCFG1_VOLT_TRIM_TRIMBOD_H_SHIFT)
#define FCFG1_VOLT_TRIM_VDDR_TRIM_SLEEP_H_SHIFT            (8)       /* Bits 8-12 */
#define FCFG1_VOLT_TRIM_VDDR_TRIM_SLEEP_H_MASK             (31 << FCFG1_VOLT_TRIM_VDDR_TRIM_SLEEP_H_SHIFT)
#  define FCFG1_VOLT_TRIM_VDDR_TRIM_SLEEP_H(n)             ((uint32_t)(n) << FCFG1_VOLT_TRIM_VDDR_TRIM_SLEEP_H_SHIFT)
#define FCFG1_VOLT_TRIM_VDDR_TRIM_H_SHIFT                  (16)      /* Bits 16-20 */
#define FCFG1_VOLT_TRIM_VDDR_TRIM_H_MASK                   (31 << FCFG1_VOLT_TRIM_VDDR_TRIM_H_SHIFT)
#  define FCFG1_VOLT_TRIM_VDDR_TRIM_H(n)                   ((uint32_t)(n) << FCFG1_VOLT_TRIM_VDDR_TRIM_H_SHIFT)
#define FCFG1_VOLT_TRIM_VDDR_TRIM_HH_SHIFT                 (24)      /* Bits 24-28 */
#define FCFG1_VOLT_TRIM_VDDR_TRIM_HH_MASK                  (31 << FCFG1_VOLT_TRIM_VDDR_TRIM_HH_SHIFT)
#  define FCFG1_VOLT_TRIM_VDDR_TRIM_HH(n)                  ((uint32_t)(n) << FCFG1_VOLT_TRIM_VDDR_TRIM_HH_SHIFT)

/* TIVA_FCFG1_OSC_CONF */

#define FCFG1_OSC_CONF_HPOSC_DIV3_BYPASS                   (1 << 0)  /* Bit 0 */
#define FCFG1_OSC_CONF_HPOSC_SERIES_CAP_SHIFT              (1)       /* Bits 1-2 */
#define FCFG1_OSC_CONF_HPOSC_SERIES_CAP_MASK               (3 << FCFG1_OSC_CONF_HPOSC_SERIES_CAP_SHIFT)
#  define FCFG1_OSC_CONF_HPOSC_SERIES_CAP(n)               ((uint32_t)(n) << FCFG1_OSC_CONF_HPOSC_SERIES_CAP_SHIFT)
#define FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY_SHIFT     (5)       /* Bits 5-6 */
#define FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY_MASK      (3 << FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY_SHIFT)
#  define FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY(n)      ((uint32_t)(n) << FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY_SHIFT)
#define FCFG1_OSC_CONF_HPOSC_FILTER_EN                     (1 << 7)  /* Bit 7 */
#define FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET_SHIFT            (8)       /* Bits 8-11 */
#define FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET_MASK             (15 << FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET_SHIFT)
#  define FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET(n)             ((uint32_t)(n) << FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET_SHIFT)
#define FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO_SHIFT          (12)      /* Bits 12-15 */
#define FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO_MASK           (15 << FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO_SHIFT)
#  define FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO(n)           ((uint32_t)(n) << FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO_SHIFT)
#define FCFG1_OSC_CONF_HPOSC_BIAS_HOLD_MODE_EN             (1 << 16) /* Bit 15 */
#define FCFG1_OSC_CONF_HPOSC_OPTION                        (1 << 17) /* Bit 17  */
#define FCFG1_OSC_CONF_XOSC_OPTION                         (1 << 18) /* Bit 18: XOSC_HF available */
#define FCFG1_OSC_CONF_XOSC_HF_FAST_START_SHIFT            (19)      /* Bits 19-20: Trim value for DDI_0_OSC:CTL1.XOSC_HF_FAST_START */
#define FCFG1_OSC_CONF_XOSC_HF_FAST_START_MASK             (3 << FCFG1_OSC_CONF_XOSC_HF_FAST_START_SHIFT)
#  define FCFG1_OSC_CONF_XOSC_HF_FAST_START(n)             ((uint32_t)(n) << FCFG1_OSC_CONF_XOSC_HF_FAST_START_SHIFT)
#define FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO_SHIFT          (21)      /* Bits 21-24: rim value for DDI_0_OSC:LFOSCCTL.XOSCLF_CMIRRWR_RATIO */
#define FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO_MASK           (15 << FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO_SHIFT)
#  define FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO(n)           ((uint32_t)(n) << FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO_SHIFT)
#define FCFG1_OSC_CONF_XOSCLF_REGULATOR_TRIM_SHIFT         (25)      /* Bits 25-36: Trim value for DDI_0_OSC:LFOSCCTL.XOSCLF_REGULATOR_TRIM */
#define FCFG1_OSC_CONF_XOSCLF_REGULATOR_TRIM_MASK          (3 << FCFG1_OSC_CONF_XOSCLF_REGULATOR_TRIM_SHIFT)
#  define FCFG1_OSC_CONF_XOSCLF_REGULATOR_TRIM(n)          ((uint32_t)(n) << FCFG1_OSC_CONF_XOSCLF_REGULATOR_TRIM_SHIFT)
#define FCFG1_OSC_CONF_ATESTLF_RCOSCLF_IBIAS_TRIM          (1 << 27) /* Bit 27: Trim value for DDI_0_OSC:ATESTCTL.ATESTLF_RCOSCLF_IBIAS_TRIM */
#define FCFG1_OSC_CONF_ADC_SH_MODE_EN                      (1 << 28) /* Bit 28: Trim value for DDI_0_OSC:ADCDOUBLERNANOAMPCTL.ADC_SH_MODE_EN */
#define FCFG1_OSC_CONF_ADC_SH_VBUF_EN                      (1 << 29) /* Bit 28: Trim value for DDI_0_OSC:ADCDOUBLERNANOAMPCTL.ADC_SH_VBUF_EN */

/* TIVA_FCFG1_FREQ_OFFSET */

#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P2_SHIFT              (0)       /* Bits 0-7 */
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P2_MASK               (0xff << FCFG1_FREQ_OFFSET_HPOSC_COMP_P2_SHIFT)
#  define FCFG1_FREQ_OFFSET_HPOSC_COMP_P2(n)               ((uint32_t)(n) << FCFG1_FREQ_OFFSET_HPOSC_COMP_P2_SHIFT)
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P1_SHIFT              (8)      /* Bits 8-15 */
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P1_MASK               (0xff << FCFG1_FREQ_OFFSET_HPOSC_COMP_P1_SHIFT)
#  define FCFG1_FREQ_OFFSET_HPOSC_COMP_P1(n)               ((uint32_t)(n) << FCFG1_FREQ_OFFSET_HPOSC_COMP_P1_SHIFT)
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P0_SHIFT              (16)      /* Bits 16-31 */
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P0_MASK               (0xffff << FCFG1_FREQ_OFFSET_HPOSC_COMP_P0_SHIFT)
#  define FCFG1_FREQ_OFFSET_HPOSC_COMP_P0(n)               ((uint32_t)(n) << FCFG1_FREQ_OFFSET_HPOSC_COMP_P0_SHIFT)

