apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_fcfg1.h
/* TVIA_FCFG1_CAP_TRIM */

#define FCFG1_CAP_TRIM_FLUX_CAP_0P4_TRIM_SHIFT             (16)      /* Bits 16-31 */
#define FCFG1_CAP_TRIM_FLUX_CAP_0P4_TRIM_MASK              (0xffff << FCFG1_CAP_TRIM_FLUX_CAP_0P4_TRIM_SHIFT)
#  define FCFG1_CAP_TRIM_FLUX_CAP_0P4_TRIM(n)              ((uint32_t)(n) << FCFG1_CAP_TRIM_FLUX_CAP_0P4_TRIM_SHIFT)
#define FCFG1_CAP_TRIM_FLUX_CAP_0P28_TRIM_SHIFT            (16)      /* Bits 16-31 */
#define FCFG1_CAP_TRIM_FLUX_CAP_0P28_TRIM_MASK             (0xffff << FCFG1_CAP_TRIM_FLUX_CAP_0P28_TRIM_SHIFT)
#  define FCFG1_CAP_TRIM_FLUX_CAP_0P28_TRIM(n)             ((uint32_t)(n) << FCFG1_CAP_TRIM_FLUX_CAP_0P28_TRIM_SHIFT)

/* TIVA_FCFG1_MISC_OTP_DATA_1 */

#define FCFG1_MISC_OTP_DATA_1_IDAC_STEP_SHIFT                      (0)       /* Bits 0-3 */
#define FCFG1_MISC_OTP_DATA_1_IDAC_STEP_MASK                       (15 << FCFG1_MISC_OTP_DATA_1_IDAC_STEP_SHIFT)
#  define FCFG1_MISC_OTP_DATA_1_IDAC_STEP(n)                       ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_1_IDAC_STEP_SHIFT)
#define FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_SHIFT             (4)       /* Bits 4-9 */
#define FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_MASK              (0x3f << FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_SHIFT)
#  define FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT(n)              ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_SHIFT)
#define FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_SHIFT             (10)      /* Bits 10-19 */
#define FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_MASK              (0x3ff << FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_SHIFT)
#  define FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT(n)              ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_SHIFT)
#define FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_SHIFT (20)      /* Bits 20-21 */
#define FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_MASK  (3 << FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_SHIFT)
#  define FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE(n)  ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_SHIFT)
#define FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_SHIFT                   (22)      /* Bits 22-23 */
#define FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_MASK                    (3 << FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_SHIFT)
#  define FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM(n)                    ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_SHIFT)
#define FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_SHIFT                   (24)      /* Bits 24-26 */
#define FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_MASK                    (7 << FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_SHIFT)
#  define FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM(n)                    ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_SHIFT)
#define FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_SHIFT                 (27)      /* Bits 27-28 */
#define FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_MASK                  (3 << FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_SHIFT)
#  define FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM(n)                  ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_SHIFT)

/* TIVA_FCFG1_PWD_CURR_20C */

#define FCFG1_PWD_CURR_20C_BASELINE_SHIFT                  (0)      /* Bits 0-7: Worst-case baseline maximum powerdown current, in units of 0.5uA */
#define FCFG1_PWD_CURR_20C_BASELINE_MASK                   (0xff << FCFG1_PWD_CURR_20C_BASELINE_SHIFT)
#  define FCFG1_PWD_CURR_20C_BASELINE(n)                   ((uint32_t)(n) << FCFG1_PWD_CURR_20C_BASELINE_SHIFT)
#define FCFG1_PWD_CURR_20C_DELTA_XOSC_LPM_SHIFT            (8)      /* Bits 8-15: Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode */
#define FCFG1_PWD_CURR_20C_DELTA_XOSC_LPM_MASK             (0xff << FCFG1_PWD_CURR_20C_DELTA_XOSC_LPM_SHIFT)
#  define FCFG1_PWD_CURR_20C_DELTA_XOSC_LPM(n)             ((uint32_t)(n) << FCFG1_PWD_CURR_20C_DELTA_XOSC_LPM_SHIFT)
#define FCFG1_PWD_CURR_20C_DELTA_RFMEM_RET_SHIFT           (16)      /* Bits 16-23: Additional maximum current, in 1uA units, with RF memory retention */
#define FCFG1_PWD_CURR_20C_DELTA_RFMEM_RET_MASK            (0xff << FCFG1_PWD_CURR_20C_DELTA_RFMEM_RET_SHIFT)
#  define FCFG1_PWD_CURR_20C_DELTA_RFMEM_RET(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_20C_DELTA_RFMEM_RET_SHIFT)
#define FCFG1_PWD_CURR_20C_DELTA_CACHE_REF_SHIFT           (24)      /* Bits 24-31: Additional maximum current, in units of 1uA, with cache retention */
#define FCFG1_PWD_CURR_20C_DELTA_CACHE_REF_MASK            (0xff << FCFG1_PWD_CURR_20C_DELTA_CACHE_REF_SHIFT)
#  define FCFG1_PWD_CURR_20C_DELTA_CACHE_REF(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_20C_DELTA_CACHE_REF_SHIFT)

/* TIVA_FCFG1_PWD_CURR_35C */

#define FCFG1_PWD_CURR_35C_BASELINE_SHIFT                  (0)       /* Bits 0-7:  Worst-case baseline maximum powerdown current, in units of 0.5uA */
#define FCFG1_PWD_CURR_35C_BASELINE_MASK                   (0xff << FCFG1_PWD_CURR_35C_BASELINE_SHIFT)
#  define FCFG1_PWD_CURR_35C_BASELINE(n)                   ((uint32_t)(n) << FCFG1_PWD_CURR_35C_BASELINE_SHIFT)
#define FCFG1_PWD_CURR_35C_DELTA_XOSC_LPM_SHIFT            (8)       /* Bits 8-15: Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode */
#define FCFG1_PWD_CURR_35C_DELTA_XOSC_LPM_MASK             (0xff << FCFG1_PWD_CURR_35C_DELTA_XOSC_LPM_SHIFT)
#  define FCFG1_PWD_CURR_35C_DELTA_XOSC_LPM(n)             ((uint32_t)(n) << FCFG1_PWD_CURR_35C_DELTA_XOSC_LPM_SHIFT)
#define FCFG1_PWD_CURR_35C_DELTA_RFMEM_RET_SHIFT           (16)      /* Bits 16-23: Additional maximum current, in 1uA units, with RF memory retention */
#define FCFG1_PWD_CURR_35C_DELTA_RFMEM_RET_MASK            (0xff << FCFG1_PWD_CURR_35C_DELTA_RFMEM_RET_SHIFT)
#  define FCFG1_PWD_CURR_35C_DELTA_RFMEM_RET(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_35C_DELTA_RFMEM_RET_SHIFT)
#define FCFG1_PWD_CURR_35C_DELTA_CACHE_REF_SHIFT           (24)      /* Bits 24-31: Additional maximum current, in units of 1uA, with cache retention */
#define FCFG1_PWD_CURR_35C_DELTA_CACHE_REF_MASK            (0xff << FCFG1_PWD_CURR_35C_DELTA_CACHE_REF_SHIFT)
#  define FCFG1_PWD_CURR_35C_DELTA_CACHE_REF(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_35C_DELTA_CACHE_REF_SHIFT)

/* TIVA_FCFG1_PWD_CURR_50C */

#define FCFG1_PWD_CURR_50C_BASELINE_SHIFT                  (0)       /* Bits 0-7: Worst-case baseline maximum powerdown current, in units of 0.5uA */
#define FCFG1_PWD_CURR_50C_BASELINE_MASK                   (0xff << FCFG1_PWD_CURR_50C_BASELINE_SHIFT)
#  define FCFG1_PWD_CURR_50C_BASELINE(n)                   ((uint32_t)(n) << FCFG1_PWD_CURR_50C_BASELINE_SHIFT)
#define FCFG1_PWD_CURR_50C_DELTA_XOSC_LPM_SHIFT            (8)       /* Bits 8-15: Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode */
#define FCFG1_PWD_CURR_50C_DELTA_XOSC_LPM_MASK             (0xff << FCFG1_PWD_CURR_50C_DELTA_XOSC_LPM_SHIFT)
#  define FCFG1_PWD_CURR_50C_DELTA_XOSC_LPM(n)             ((uint32_t)(n) << FCFG1_PWD_CURR_50C_DELTA_XOSC_LPM_SHIFT)
#define FCFG1_PWD_CURR_50C_DELTA_RFMEM_RET_SHIFT           (16)      /* Bits 16-23: Additional maximum current, in 1uA units, with RF memory retention */
#define FCFG1_PWD_CURR_50C_DELTA_RFMEM_RET_MASK            (0xff << FCFG1_PWD_CURR_50C_DELTA_RFMEM_RET_SHIFT)
#  define FCFG1_PWD_CURR_50C_DELTA_RFMEM_RET(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_50C_DELTA_RFMEM_RET_SHIFT)
#define FCFG1_PWD_CURR_50C_DELTA_CACHE_REF_SHIFT           (24)      /* Bits 24-31: Additional maximum current, in units of 1uA, with cache retention */
#define FCFG1_PWD_CURR_50C_DELTA_CACHE_REF_MASK            (0xff << FCFG1_PWD_CURR_50C_DELTA_CACHE_REF_SHIFT)
#  define FCFG1_PWD_CURR_50C_DELTA_CACHE_REF(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_50C_DELTA_CACHE_REF_SHIFT)

/* TIVA_FCFG1_PWD_CURR_65C */

#define FCFG1_PWD_CURR_65C_BASELINE_SHIFT                  (0)       /* Bits 0-7: Worst-case baseline maximum powerdown current, in units of 0.5uA */
#define FCFG1_PWD_CURR_65C_BASELINE_MASK                   (0xff << FCFG1_PWD_CURR_65C_BASELINE_SHIFT)
#  define FCFG1_PWD_CURR_65C_BASELINE(n)                   ((uint32_t)(n) << FCFG1_PWD_CURR_65C_BASELINE_SHIFT)
#define FCFG1_PWD_CURR_65C_DELTA_XOSC_LPM_SHIFT            (8)       /* Bits 8-15: Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode */
#define FCFG1_PWD_CURR_65C_DELTA_XOSC_LPM_MASK             (0xff << FCFG1_PWD_CURR_65C_DELTA_XOSC_LPM_SHIFT)
#  define FCFG1_PWD_CURR_65C_DELTA_XOSC_LPM(n)             ((uint32_t)(n) << FCFG1_PWD_CURR_65C_DELTA_XOSC_LPM_SHIFT)
#define FCFG1_PWD_CURR_65C_DELTA_RFMEM_RET_SHIFT           (16)      /* Bits 16-23: Additional maximum current, in 1uA units, with RF memory retention */
#define FCFG1_PWD_CURR_65C_DELTA_RFMEM_RET_MASK            (0xff << FCFG1_PWD_CURR_65C_DELTA_RFMEM_RET_SHIFT)
#  define FCFG1_PWD_CURR_65C_DELTA_RFMEM_RET(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_65C_DELTA_RFMEM_RET_SHIFT)
#define FCFG1_PWD_CURR_65C_DELTA_CACHE_REF_SHIFT           (24)      /* Bits 24-31: Additional maximum current, in units of 1uA, with cache retention */
#define FCFG1_PWD_CURR_65C_DELTA_CACHE_REF_MASK            (0xff << FCFG1_PWD_CURR_65C_DELTA_CACHE_REF_SHIFT)
#  define FCFG1_PWD_CURR_65C_DELTA_CACHE_REF(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_65C_DELTA_CACHE_REF_SHIFT)

/* TIVA_FCFG1_PWD_CURR_80C */

