apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_fcfg1.h
#define FCFG1_PWD_CURR_80C_BASELINE_SHIFT                  (0)       /* Bits 0-7: Worst-case baseline maximum powerdown current, in units of 0.5uA */
#define FCFG1_PWD_CURR_80C_BASELINE_MASK                   (0xff << FCFG1_PWD_CURR_80C_BASELINE_SHIFT)
#  define FCFG1_PWD_CURR_80C_BASELINE(n)                   ((uint32_t)(n) << FCFG1_PWD_CURR_80C_BASELINE_SHIFT)
#define FCFG1_PWD_CURR_80C_DELTA_XOSC_LPM_SHIFT            (8)       /* Bits 8-15: Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode */
#define FCFG1_PWD_CURR_80C_DELTA_XOSC_LPM_MASK             (0xff << FCFG1_PWD_CURR_80C_DELTA_XOSC_LPM_SHIFT)
#  define FCFG1_PWD_CURR_80C_DELTA_XOSC_LPM(n)             ((uint32_t)(n) << FCFG1_PWD_CURR_80C_DELTA_XOSC_LPM_SHIFT)
#define FCFG1_PWD_CURR_80C_DELTA_RFMEM_RET_SHIFT           (16)      /* Bits nn-nn: Additional maximum current, in 1uA units, with RF memory retention */
#define FCFG1_PWD_CURR_80C_DELTA_RFMEM_RET_MASK            (0xff << FCFG1_PWD_CURR_80C_DELTA_RFMEM_RET_SHIFT)
#  define FCFG1_PWD_CURR_80C_DELTA_RFMEM_RET(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_80C_DELTA_RFMEM_RET_SHIFT)
#define FCFG1_PWD_CURR_80C_DELTA_CACHE_REF_SHIFT           (24)      /* Bits 24-31: Additional maximum current, in units of 1uA, with cache retention */
#define FCFG1_PWD_CURR_80C_DELTA_CACHE_REF_MASK            (0xff << FCFG1_PWD_CURR_80C_DELTA_CACHE_REF_SHIFT)
#  define FCFG1_PWD_CURR_80C_DELTA_CACHE_REF(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_80C_DELTA_CACHE_REF_SHIFT)

/* TIVA_FCFG1_PWD_CURR_95C */

#define FCFG1_PWD_CURR_95C_BASELINE_SHIFT                  (0)       /* Bits 0-7: Worst-case baseline maximum powerdown current, in units of 0.5uA */
#define FCFG1_PWD_CURR_95C_BASELINE_MASK                   (0xff << FCFG1_PWD_CURR_95C_BASELINE_SHIFT)
#  define FCFG1_PWD_CURR_95C_BASELINE(n)                   ((uint32_t)(n) << FCFG1_PWD_CURR_95C_BASELINE_SHIFT)
#define FCFG1_PWD_CURR_95C_DELTA_XOSC_LPM_SHIFT            (8)       /* Bits 8-15: Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode */
#define FCFG1_PWD_CURR_95C_DELTA_XOSC_LPM_MASK             (0xff << FCFG1_PWD_CURR_95C_DELTA_XOSC_LPM_SHIFT)
#  define FCFG1_PWD_CURR_95C_DELTA_XOSC_LPM(n)             ((uint32_t)(n) << FCFG1_PWD_CURR_95C_DELTA_XOSC_LPM_SHIFT)
#define FCFG1_PWD_CURR_95C_DELTA_RFMEM_RET_SHIFT           (16)      /* Bits 16-23: Additional maximum current, in 1uA units, with RF memory retention */
#define FCFG1_PWD_CURR_95C_DELTA_RFMEM_RET_MASK            (0xff << FCFG1_PWD_CURR_95C_DELTA_RFMEM_RET_SHIFT)
#  define FCFG1_PWD_CURR_95C_DELTA_RFMEM_RET(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_95C_DELTA_RFMEM_RET_SHIFT)
#define FCFG1_PWD_CURR_95C_DELTA_CACHE_REF_SHIFT           (24)      /* Bits 24-31: Additional maximum current, in units of 1uA, with cache retention */
#define FCFG1_PWD_CURR_95C_DELTA_CACHE_REF_MASK            (0xff << FCFG1_PWD_CURR_95C_DELTA_CACHE_REF_SHIFT)
#  define FCFG1_PWD_CURR_95C_DELTA_CACHE_REF(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_95C_DELTA_CACHE_REF_SHIFT)

/* TIVA_FCFG1_PWD_CURR_110C */

#define FCFG1_PWD_CURR_110C_BASELINE_SHIFT                 (0)       /* Bits 0-7: Worst-case baseline maximum powerdown current, in units of 0.5uA */
#define FCFG1_PWD_CURR_110C_BASELINE_MASK                  (0xff << FCFG1_PWD_CURR_110C_BASELINE_SHIFT)
#  define FCFG1_PWD_CURR_110C_BASELINE(n)                  ((uint32_t)(n) << FCFG1_PWD_CURR_110C_BASELINE_SHIFT)
#define FCFG1_PWD_CURR_110C_DELTA_XOSC_LPM_SHIFT           (8)       /* Bits 8-15: Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode */
#define FCFG1_PWD_CURR_110C_DELTA_XOSC_LPM_MASK            (0xff << FCFG1_PWD_CURR_110C_DELTA_XOSC_LPM_SHIFT)
#  define FCFG1_PWD_CURR_110C_DELTA_XOSC_LPM(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_110C_DELTA_XOSC_LPM_SHIFT)
#define FCFG1_PWD_CURR_110C_DELTA_RFMEM_RET_SHIFT          (16)      /* Bits 16-23: Additional maximum current, in 1uA units, with RF memory retention */
#define FCFG1_PWD_CURR_110C_DELTA_RFMEM_RET_MASK           (0xff << FCFG1_PWD_CURR_110C_DELTA_RFMEM_RET_SHIFT)
#  define FCFG1_PWD_CURR_110C_DELTA_RFMEM_RET(n)           ((uint32_t)(n) << FCFG1_PWD_CURR_110C_DELTA_RFMEM_RET_SHIFT)
#define FCFG1_PWD_CURR_110C_DELTA_CACHE_REF_SHIFT          (24)      /* Bits 24-31: Additional maximum current, in units of 1uA, with cache retention */
#define FCFG1_PWD_CURR_110C_DELTA_CACHE_REF_MASK           (0xff << FCFG1_PWD_CURR_110C_DELTA_CACHE_REF_SHIFT)
#  define FCFG1_PWD_CURR_110C_DELTA_CACHE_REF(n)           ((uint32_t)(n) << FCFG1_PWD_CURR_110C_DELTA_CACHE_REF_SHIFT)

/* TIVA_FCFG1_PWD_CURR_125C */

#define FCFG1_PWD_CURR_125C_BASELINE_SHIFT                 (0)       /* Bits 0-7: Worst-case baseline maximum powerdown current, in units of 0.5uA */
#define FCFG1_PWD_CURR_125C_BASELINE_MASK                  (0xff << FCFG1_PWD_CURR_125C_BASELINE_SHIFT)
#  define FCFG1_PWD_CURR_125C_BASELINE(n)                  ((uint32_t)(n) << FCFG1_PWD_CURR_125C_BASELINE_SHIFT)
#define FCFG1_PWD_CURR_125C_DELTA_XOSC_LPM_SHIFT           (8)       /* Bits 8-15: Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode */
#define FCFG1_PWD_CURR_125C_DELTA_XOSC_LPM_MASK            (0xff << FCFG1_PWD_CURR_125C_DELTA_XOSC_LPM_SHIFT)
#  define FCFG1_PWD_CURR_125C_DELTA_XOSC_LPM(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_125C_DELTA_XOSC_LPM_SHIFT)
#define FCFG1_PWD_CURR_125C_DELTA_RFMEM_RET_SHIFT          (16)      /* Bits 16-23: Additional maximum current, in 1uA units, with RF memory retention */
#define FCFG1_PWD_CURR_125C_DELTA_RFMEM_RET_MASK           (0xff << FCFG1_PWD_CURR_125C_DELTA_RFMEM_RET_SHIFT)
#  define FCFG1_PWD_CURR_125C_DELTA_RFMEM_RET(n)           ((uint32_t)(n) << FCFG1_PWD_CURR_125C_DELTA_RFMEM_RET_SHIFT)
#define FCFG1_PWD_CURR_125C_DELTA_CACHE_REF_SHIFT          (24)      /* Bits 24-31: Additional maximum current, in units of 1uA, with cache retention */
#define FCFG1_PWD_CURR_125C_DELTA_CACHE_REF_MASK           (0xff << FCFG1_PWD_CURR_125C_DELTA_CACHE_REF_SHIFT)
#  define FCFG1_PWD_CURR_125C_DELTA_CACHE_REF(n)           ((uint32_t)(n) << FCFG1_PWD_CURR_125C_DELTA_CACHE_REF_SHIFT)

#endif /* __ARCH_ARM_SRC_TIVA_HARDWARE_CC13X0_CC13X0_FCFG1_H */
